[
{"date": "2019-10-06 22:33", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-real-estate-agents-property/6994220121.html", "text": "Real estate agents, property managers, contractors, property related", "compensation": "$30-100 per week", "type": "part-time", "address": ["\n        ", "\nLooking for NYC based people working in the residential real estate industry. Agents, property managers, contractors, building staff, architects, engineers, inspectors, DOB workers, general service (builders, plumbers, roofers, etc) for part time work building out a real estate related website gohomeny.com. Residential real estate focused. Pay is $30-100 per week depending on time commitment. Please email for more information    "]},
{"date": "2019-10-02 18:18", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-architectural-metal-drafter/6991423077.html", "text": "Architectural Metal Drafter", "compensation": "Compensation: TBD on Experience and Position", "type": "full-time", "address": ["\n        ", "\nOur company designs and fabricates architectural metal for a variety of jobs. We are looking for experienced and motivated people to begin work immediately here at Phoenix Metal Designs.", "\n", "\nWe are looking to hire a talented Architectural Drafter with a minimum of 5-years experience for a full-time position.", "\n", "\nAn ideal candidate can perform the following tasks:", "\n", "\nMake accurate take-offs", "\n", "\nComplete submittal process", "\n", "\nAnalyze building codes, by-laws, space, site requirements, technical documents and reports to determine their effect on architectural designs.", "\n", "\nCheck dimensions of materials to be used and assign numbers to lists of materials.", "\n", "\nHave proficiency in AutoCad and AutoDesk Inventor.", "\n", "\nMake accurate shop drawings to be used for in-house fabrication.", "\n", "\nWork well and coordinate with floor manager to oversee proper fabrication of materials.", "\n", "\nCommunicate with team members and clients throughout development of projects.", "\n", "\nNote: Day to day projects may vary widely: flexibility and the ability to adapt quickly are required.", "\n", "\nRegular job hours are 7:00 AM - 4:00 PM Monday through Friday.", "\n", "\nWork will be required both in shop and in the field.", "\n", "\nCompensation: TBD on Experience and Position", "\nEmployment Type: Full-time    "]},
{"date": "2019-10-03 08:02", "link": "https://newyork.craigslist.org/que/egr/d/long-island-city-pe-or-ra/6991658048.html", "text": "PE or RA", "compensation": "above industry standards", "type": "full-time", "address": ["\n        ", "\nRequired is NYS RA or PE, (EIT considered)", "\nYou may come from any structural, mechanical, architectural or any other relevant PE or RA sub discipline. ", "\n", "\nWe are a small-mid sized Professional Corp., located in LONG ISLAND CITY, Queens, we provide contractor support for a wide range of NYC DOB required submissions (EQ, DM, SOE, STRUCTURAL STABILITY), as well as architectural, egress, zoning and filing submissions. ", "\n", "\n-Our contractor support design engineering firm is in need of a FIELD ORIENTED NYS RA or PE for afternoon and evening work, TYPICAL DAY varies from 9-5 to noon-8PM. Due to the reality that the majority of our NYC School Construction Authority contractor clients typically work afternoon/evening shift, we are in search of a field oriented PE/RA to attend scaffold, sidewalk shed, shoring inspections during stated hours.", "\n-You will also be asked to attend SCA and DOB plan exams when inspections not scheduled, as well as responding to objections from plan exams. On days without field work, hours can be 9-5 or 8-4. Flexibility required, employee preference considered. ", "\n", "\nRequired is a valid NYS RA or PE license. ", "\nRequired is an ability to represent well and communicate well with professionals and nonprofessionals. ", "\nRequired is an ability to visualize load paths for all components and connections. ", "\nRequired is an ability to quickly get report data to our central office, and out to clients.", "\nRequired is an ability to efficiently climb ladders and scaffold. ", "\nYou will be commuting all over the 5 boroughs, efficiently routed with the help of our scheduler. The use of subway, citibike, as well as car travel (private or Car-to-go) is strongly encouraged, required for time management in our congested city. Valid drivers license is preferred. ", "\n", "\nYou will not be required to perform heavy calculations or design services, but, this ability is a plus. ", "\nYou do not need shed or scaffold inspection experience, as you will receive training as necessary from our principal PE.", "\nYou will need to become intimate with NYC building code chapter 33, as well as many other relevant sections, if not already familiar.", "\nYou do not need autocad experience, but also is a strong plus.", "\n", "\nThis position can be filled by an RA or PE with any amount of years of experience.", "\nWE ARE OPEN TO CONSIDERING HARD WORKING APPLICANTS WITH MORE EXPERIENCE, AND WILL COMPENSATE ACCORDINGLY.", "\nEven though the work hours are swing shift, this is a 40+- hour week job offer, not a consultancy structure.", "\n", "\nBENEFITS:", "\nAs well as competitive salaries, we offer employer contribution in health/dental care, 401k matching saving plan, weekly employer sponsored team building lunch, in-house continuing ed (as part of our IAS accredidation), and basically an all around fun time producing and inspecting serious highly respected products!", "\n", "\nFor consideration: Please provide resume which shows work history and job durations.", "\nIn cover letter, please state your salary range requirements, and anything you would like us to know about why you think you are a good candidate. ", "\n Please include resume in body of email or as pdf. Please do not send word docs. ", "\n", "\nGood Luck in your job search!    "]},
{"date": "2019-10-01 15:29", "link": "https://newyork.craigslist.org/wch/egr/d/yonkers-estimator-needed/6990559803.html", "text": "Estimator Needed", "compensation": "TBD", "type": "employee's choice", "address": ["\n        ", "\nPT or FT Estimator needed for busy HVAC company.  We are growing quickly and we would like to find someone to join our team.  Please have knowledge of the HVAC industry and have prior experience. Please forward a resume with your reply.    "]},
{"date": "2019-10-01 11:04", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-high-end-architectural-firm/6990315518.html", "text": "High-End Architectural Firm Seeking Interior Design Intern", "compensation": "Travel Reimbursed", "type": "part-time", "address": ["\n        ", "\nWe are a small, high-end architectural design firm seeking a part-time Interior Design intern 2-3 days per week. This is an unpaid, entry level position with great opportunity for a design student looking to gain valuable field experience. Transportation will be reimbursed. ", "\n", "\nDuties Include:", "\nMaintain Sample Department / Library ", "\nAnswer Phones", "\nSend/Receive Mailings", "\nOrder/Maintain Supplies", "\nFiling", "\nAssist Staff as Needed", "\n", "\nRequired Skills:", "\nProfessionalism", "\nGood communication skills for phone and email correspondence", "\nAbility to Multi-Task ", "\nOrganized ", "\nCurrently Studying Architectural/Interior Design ", "\nMicrosoft Office ", "\nAuto-Cad, Sketch-Up, Photoshop Experience a Plus!", "\nPortfolios Welcomed", "\n", "\nEmail cover letter, resume, and portfolio (if available). ", "\nNo phone calls, please.", "\n    "]},
{"date": "2019-10-03 13:13", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-junior-architect-real-estate/6991887366.html", "text": "Junior Architect | Real Estate + Construction", "compensation": "70-80K, depending upon skill level.", "type": "full-time", "address": ["\n        ", "\nJunior Architect to perform project management related tasks on multiple interior renovation projects through punch list and project closeout. ", "\nTrack invoices and all project documentation.", "\nCoordinate with Corporate Facilities department.", "\n", "\nRequirements to be considered include:", "\nExperience as a Junior Architect.", "\nDegree from an accredited University.", "\nPrior Revit exposure for review and coordination of drawings. ", "\nCurrently authorized and eligible to work immediately in the U.S. for any employer.", "\n    "]},
{"date": "2019-10-02 15:13", "link": "https://newyork.craigslist.org/fct/egr/d/stamford-earn-up-to-19-hr-deliver-with/6991273681.html", "text": "Earn up to $19/hr! Deliver with Grubhub - Apply now!", "compensation": "Per order fee + mileage + 100% tips", "type": "contract", "address": ["\n        ", "\n\n        ", "\n    "]},
{"date": "2019-10-02 17:13", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-drafter/6991373881.html", "text": "Drafter", "compensation": "TBD", "type": "full-time", "address": ["\n        ", "\nBuilding Consulting firm looking for drafter with expertise in Auto cad 3D modeling and Revit preferred. ", "\n", "\nRESPONSIBILITIES:", "\n• Survey existing and as-built conditions on sites located throughout the NYC area", "\n• Prepare Architectural Drawings and Construction Documents ", "\n• Drawing existing and proposed sections and elevations", "\n", "\nQualifications:", "\nProficiency in Auto cad.", "\nEnthusiasm and willing to learn", "\n", "\n We are looking for outgoing individuals who are willing to take on responsibility and grow in the field. Interested candidates must be quick to learn and adapt to new drawing methods, eager to take on challenges.", "\n", "\n Qualified individuals should submit a brief description of your qualifications,  starting salary requirements, in pdf or word format    "]},
{"date": "2019-10-01 12:37", "link": "https://newyork.craigslist.org/que/egr/d/woodside-construction-estimator/6990400729.html", "text": "Construction Estimator immediate opening", "compensation": "negotiable", "type": "full-time", "address": ["\n        ", "\nNYC construction firm looking for a construction estimator with 10+ years of experience in interior construction and renovations. Incentives for leads and profit sharing plan available.", "\n", "\nDuties include but are not limited to preliminary review of bid packages, preparing proposals, take offs, analyzing drawings (blueprints), following up on RFIs, being a liaison between company and subcontractors, attend meetings and progress walk-throughs, follow up on quotes from vendors and suppliers.", "\n", "\nMUST HAVE ten years experience in the field, knowledge of construction software/PlanSwift, strong analytical and communication skills. ", "\n", "\nKnowledge of numbers and prices is a must.  Must have excellent understanding of supplier and item pricing.  Must be detail oriented and possess good customer service skills. Must work well with others,  have good work ethic, be self motivated and a team player.", "\n    "]},
{"date": "2019-10-01 15:10", "link": "https://newyork.craigslist.org/fct/egr/d/stamford-earn-up-to-19-hr-deliver-with/6990543501.html", "text": "Earn up to $19/hr! Deliver with Grubhub - Apply now!", "compensation": "Per order fee + mileage + 100% tips", "type": "contract", "address": ["\n        ", "\n\n        ", "\n    "]},
{"date": "2019-10-03 14:05", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-cad-bim-modeler-temporary/6991935576.html", "text": "CAD/BIM MODELER - Temporary Position", "compensation": "Commensurate with experience and Qualifications", "type": "contract", "address": ["\n        ", "\nLERA Consulting Structrural Engineers is looking for a Temporary CAD/BIM Modeler to join their New York team.", "\n", "\nResponsibilities: ", "\nThe CAD/ BIM Modeler will be involved in developing detailed models and construction documents related to the structural engineering discipline.  Responsibilities include: ", "\n•\tDeveloping detailed design drawings using Revit and AutoCAD software.", "\n•\tWorking with fellow CAD/ BIM Modelers in a supportive role on projects.", "\n•\tModifying drawings and 3D modeled elements based on Interpreted engineer’s markups.", "\n•\tCollaborating with structural engineers to layout and detail components and structural systems.", "\n ", "\nRequirements: ", "\n•\tExcellent knowledge of Revit and AutoCAD software.", "\n•\tStrong attention to detail with emphasis on organization.", "\n•\tKnowledge of Microsoft office applications.", "\n•\tAbility to work independently and meet deadlines.", "\n•\tAbility to exercise independent judgment using technical knowledge.", "\n•\tGood interpersonal skills and ability to coordinate with others.", "\n•\tStrong organizational skills and effective written/verbal communication skills.", "\n•\tDegree in an AEC-related discipline and knowledge of Rhino, Grasshopper, Dynamo and/or Tekla preferred.", "\n    "]},
{"date": "2019-10-03 15:13", "link": "https://newyork.craigslist.org/fct/egr/d/stamford-earn-up-to-19-hr-deliver-with/6991996359.html", "text": "Earn up to $19/hr! Deliver with Grubhub - Apply now!", "compensation": "Per order fee + mileage + 100% tips", "type": "contract", "address": ["\n        ", "\n\n        ", "\n    "]},
{"date": "2019-10-03 15:41", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-sales-design-coordinator/6992020637.html", "text": "Sales & Design Coordinator", "compensation": "This role offers a competitive salary in addition to inclusion in the company’s profit sharing, 401K, medical, and dental programs.", "type": "full-time", "address": ["\n        ", "\nAmuneal Manufacturing Corp. has an immediate opening in our New York Showroom for a Sales & Design Coordinator.  This role will focus on our luxury furniture and architectural product offerings. This role is primarily responsible for customer support and collaboration with our Sales + Design team. ", " \n", "\nConfidence, a clean design aesthetic, the ability to spark interest in others, direct customer interaction and experience in the selling of high-end designed products are a must. Candidates must have the ability to organize their own time, multitask in a dynamic environment, be proactive, and above all else…problem solve. We are looking for someone who is eager to connect with people and translate their needs into timeless experiences and products. To be successful, candidates must have a strong interest in the creation of high-end products. Candidates must be looking for a role where they are part of a collaborative environment and able to make an impact on the organization each day.", "\n", "\n", "\n", "\n\n", "\n", "\n", "\n", "\nPlease submit both resume and cover letter for consideration.", "\n", "\n", "\n    "]},
{"date": "2019-10-03 16:14", "link": "https://newyork.craigslist.org/mnh/egr/d/registered-architect/6992047638.html", "text": "Registered Architect", "compensation": "Please forward your salary requirements", "type": "full-time", "address": ["\n        ", "\nNelligan White Architects is seeking to hire registered architects.  Successful candidates must have a minimum of 5 years professional experience with a considerable interest in challenging public-sector work.", "\n", "\nIdeal applicants will demonstrate the following attributes:", "\n", "\n- Must be licensed in New York State", "\n- Highly motivated", "\n- The ability to work independently and as part of a team", "\n- Exemplary verbal and written communication", "\n- Previous work experience with all phases of design and construction administration", "\n- Be a conceptual thinker with strong technical skills (design and drawing)", "\n- The ability to work efficiently in a fast-paced environment", "\n", "\nLocated in the heart of the Flatiron District, Nelligan White Architects is a 25-person firm with diverse clients and committed coworkers. Our talented staff is dedicated to producing high-caliber work in both the public and private sectors.", "\n", "\nNelligan White offers a competitive salary and excellent benefits package. Interested candidates must email a cover letter, resume, and work samples as one PDF. Please reference CR-01 at top of your cover letter. No phone calls please.", "\n    "]},
{"date": "2019-10-03 16:15", "link": "https://newyork.craigslist.org/mnh/egr/d/intermediate-designer/6992048677.html", "text": "Intermediate Designer", "compensation": "Compensation based on experience.", "type": "full-time", "address": ["\n        ", "\nNelligan White Architects is a 25‐person firm located in New York’s Flatiron district. The majority of our design work is focused on municipal, cultural, education and multi‐residential housing projects, and we have been recognized for our expertise in resilience master planning and sustainability.", "\n", "\nIdeal applicants will demonstrate the following attributes:", "\n", "\n•\tHighly motivated", "\n•\tThe ability to work independently and as part of a team", "\n•\tExemplary verbal and written communication", "\n•\tPrevious work experience with all phases of design and construction administration", "\n•\tBe a conceptual thinker with strong technical skills (design and drawing)", "\n•\tExperience providing detailed construction documents is desirable", "\n•\tThe ability to work efficiently in a fast-paced environment", "\n•\tHas completed or is interested in completing IDP", "\n", "\nResponsibilities & Duties", "\n•\tPrepare original architectural plans, diagrams and data visualization.", "\n•\tPerform limited design assignments under general supervision.", "\n•\tIndependently evaluate, select and apply standard planning techniques, procedures, and criteria", "\n•\tUsing judgment for minor adaptations and modifications.", "\n•\tRecommend procedures in planning matters.", "\n•\tWork from plans/designs of others to compile data and perform design computations.", "\n•\tAssist in writing specifications.", "\n•\tVisits construction sites to gather information.", "\n•\tReceives instruction on specific assignment objectives and independently provides solutions for these objectives.", "\n•\tSupport more senior planners and architects on large projects.", "\n", "\nQualifications", "\n•\t3-5 years’ experience with a professional degree in Architecture preferred", "\n•\tHigh proficiency with AutoCAD. Adobe Suite and Revit knowledge is a plus.", "\n•\tStrong analytical and conceptual skills and ability to grasp complex functional program requirements.", "\n•\tEffective verbal and written communication skills.", "\n•\tThe ability to work well in a team environment with a collaborative and professional work ethic.", "\n", "\nApply with the following items attached as one PDF in a zip file, Please enter “Intermediate Architect” in the subject line.", "\n•\tCover letter", "\n•\tResume in PDF format", "\n•\tPortfolio and work samples include renderings and construction document samples", "\n•\tSalary requirements", "\n•\tTwo references that you have worked directly with in the last five years", "\n", "\n", "\nLocated in the heart of the Flatiron District, Nelligan White Architects is a 25-person firm with diverse clients and committed coworkers. Our talented staff is dedicated to producing high-caliber work in both the public and private sectors.", "\n", "\nNelligan White Architects offers a competitive salary and benefits package, which includes: medical, dental and vision insurance, flexible spending account, disability insurance, paid time off, holiday pay and 401(k) participation. This is a full‐time, exempt position.", "\n", "\nNelligan White Architects, PLLC provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. Nelligan White Architects expressly prohibits any form of workplace harassment based on race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, genetic information, disability or veteran status.", "\n", "\nPlease reference CI-01 at top of your cover letter. No phone calls please.    "]},
{"date": "2019-09-12 17:03", "link": "https://newyork.craigslist.org/que/egr/d/long-island-city-cad-operator-drafter/6977338799.html", "text": "CAD Operator / Drafter", "compensation": "Salary based on experience", "type": "full-time", "address": ["\n        ", "\nStructural engineering firm in Long Island City, Queens has an immediate opening for a full-time AutoCAD draftsperson.", "\n", "\nThis is NOT a telecommuting position. You must be able to come to work at our office in LIC and you must be authorized to work in the U.S. Please do not apply if you are not within commuting distance. ", "\n", "\nRequirements:", "\n• 4+ years in AutoCAD experience", "\n• Must have working experience in engineering/architectural drafting", "\n• Must be able to generate plans and sections", "\n", "\nDuties and Responsibilities:", "\n• Create detailed, accurate construction documents for structural engineering projects (commercial and residential)", "\n• Work with principal engineer to make corrections to the drawings under tight deadlines", "\n", "\nExcellent communication skills are a must.", "\n", "\nTo apply, please send resume in PDF format and email your salary requirements.", "\n    "]},
{"date": "2019-09-13 08:53", "link": "https://newyork.craigslist.org/wch/egr/d/mount-vernon-auto-cad-construction/6977658484.html", "text": "AUTO CAD / CONSTRUCTION ESTIMATOR", "compensation": "Based on Experience", "type": "full-time", "address": ["\n        ", "\nMidsize Construction Company seeking an Auto CAD / Construction Estimator to assist the estimating department for commercial high end projects. The estimator should have already gained 2-3 years' experience for evaluating bid specifications and drawings, ensuring that we have all necessary documents required to successfully bid the project. Estimators will also work with the Project Management teams to follow up on bids and budgets.", "\n", "\nCAD Operator/Construction Estimator exceptional capabilities to manage our key accounts and interface with suppliers, Engineers, Architects and End Users. Individual must possess exceptional communication skills, have high output and be able to multi-task in an extremely daily fast pace operation. Candidate must know AutoCAD and be proficient at reading exhaust shop drawings, NYC Building Department Codes and Practice: Energy Code, Zoning, and Building Code, Construction Document experience: Exhaust, electrical and plumbing.", "\n", "\nWe are a medium size construction firm with a wide range of projects, from finely crafted small-scale interior / exterior exhaust systems to new construction.  Self-directed individuals will find the position an exciting opportunity to grow and learn within a collaborative business environment.  ", "\n", "\nOnly candidates meeting all qualifications will be considered.", "\n", "\nRequirements and responsibilities includes, but are not limited to:", "\n-Minimum 2-3 years' experience for commercial bids", "\n-Must be able to utilize AutoCAD", "\n-Ability to read and analyze plans and specifications in full detail", "\n-Prepare bid packages and meet deadlines", "\n-Prepare and maintain status of plan reproduction", "\n-Review bid requirements thoroughly", "\n-Knowledge of MS Office and Adobe software", "\n-Positive, thorough, and proactive communication a must as there will be constant interaction with Clients, architects, and subcontractors", "\n    "]},
{"date": "2019-09-13 11:20", "link": "https://newyork.craigslist.org/brx/egr/d/bronx-estimator-for-city-projects/6977770166.html", "text": "Estimator for city projects", "compensation": "paid per project", "type": "full-time", "address": ["\n        ", "\nRMZ CONTRACTING company is seeking senior and junior estimators to join our family. Compensation commensurate with experience. Below are some of the skills required; although character, willingness to learn and work hard will be considered.", "\n• Review construction drawings & specifications, conduct field visits and gather all material and data necessary to determine scope of work and organize a construction cost estimate.", "\n• Prepare detailed cost estimates for residential, commercial and institutional projects, utilizing Sage Timberline Estimating software.", "\n• Prepare and organize material takeoffs utilizing On-Screen Take Off (OST) software for accuracy and seamless transition to Project Management Team.", "\n• Ability to create project schedules/timelines utilizing MS Project software.", "\n• Establish job costs through analysis of vendors/sub-contractor quotations for material/services.", "\n• Develop the scope of work for sub-contractors and assist account executive in preparation of buy-out package.", "\n• Maintain digital file of working documents as back-up for estimating database, including quotations and notes.", "\n", "\nDesired Skills And Experience", "\n", "\nMUST", "\n• Strong understanding of the NYC Construction environment as applied to urban exterior restoration and general knowledge of the estimating process, including blueprint and specification reading, as well as material and labor costs.", "\n• Proficiency in rigging requirements and experience in exterior masonry, roofing, flatwork/garage and historic preservation.", "\n• Outstanding organizational skills. Must possess a structured, logical, and methodical approach to problem solving. Must be able to meet deadlines and manage time effectively.", "\n• Excellent communication and interpersonal skills.", "\n• Must be able to effectively work with production team, from Project Managers to office staff to sub-contractors. Must be effective in directing and supporting the work of others.", "\n• Outstanding attention to detail. Ability to effectively recognize issues and discrepancies in bid documentation.", "\nPLUS", "\n", "\nKnowledge of MS Project, On-Screen Take Off, SAGE Timberline Estimating Extended and AutoCAD software.", "\n• Bachelor's degree in architecture, engineering or related discipline, or equivalent combination of technical training and experience.", "\n• At least five (5) years' experience in New york city projects Construction Estimating with a proven track record of accuracy, efficiency, and profitability.", "\n    "]},
{"date": "2019-09-13 13:24", "link": "https://newyork.craigslist.org/brk/egr/d/drafters-for-direct-hire-position/6977890471.html", "text": "Drafters for direct hire position - Bilingual Russian", "compensation": "Based on experience.", "type": "full-time", "address": ["\n        ", "\nPosition available now. We are seeking a draftsperson/project manager to work full-time in the office located in Brooklyn, preferably bilingual, (Russian).", "\nManage project quality by providing ideas and suggestions aimed at improving effectiveness of the project/department. Strong understanding of the NYC Building Codes is crucial, however, we provide training. It is a fast-paced office, and we expect the employees to have knowledge and understanding of the processes involved in getting a project approved. Able to work efficiently in tight deadlines, ever-changing team-oriented environment. Must be able to communicate effectively both orally and in writing with team members and outside professionals while proactively communicating with the Project Manager to obtain needed information to continue progress on plans. Site visits may be required depending on the projects.", "\nExperience with renderings (particularly 3D Max) is a plus. However training will be provided. Salary based on skill and experience. ", "\nPlease include resume and portfolio/samples that reflect your creativity.", "\n    "]},
{"date": "2019-09-13 13:27", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-structural-engineer-position/6977893247.html", "text": "Structural engineer position available.", "compensation": "Based on Experience", "type": "full-time", "address": ["\n        ", "\nStructural engineer position available.", "\nArchitectural Consulting Company is looking for a full time structural engineer which will work with planning and development of structural drawings, specifications for new and renovation of existing facilities, perform site visits, assisting a senior staff member in the completion of day to day projects. Strong understanding of NYC Building code is required however training will be provided. It is a fast-paced office, and we expect the employees to have knowledge and understanding of the processes involved in getting a project approved. ", "\nPlease include resume and portfolio.", "\n    "]},
{"date": "2019-09-13 14:25", "link": "https://newyork.craigslist.org/que/egr/d/draftsman-assistant-project-manager/6977950839.html", "text": "Draftsman, Assistant Project Manager", "compensation": "TBD", "type": "full-time", "address": ["\n        ", "\nA reputable Architectural Woodworking Company is looking for a full time draftsman/assistant project manager position. Only solid, professional and long term oriented please apply. This position requires excellent knowledge of AUTOCAD. Only experienced in the field apply. Please email your resume, references and salary expectations    "]},
{"date": "2019-09-13 14:26", "link": "https://newyork.craigslist.org/que/egr/d/estimator/6977952038.html", "text": "Estimator", "compensation": "TBD", "type": "full-time", "address": ["\n        ", "\nPrime Architectural Woodworking Company in NYC looking for an experienced, ambitious, positive and long term oriented individual.", "\nRequirements:", "\nExcellent knowledge of wood technology and materials. Ability to independently work on large commercial and residential projects. High work ethic and self motivation. Very good people skills.", "\nExcellent working conditions, atmosphere, pay and benefits.", "\nPlease email your resume, references and salary requirements.", "\nOnly candidates from woodworking industry please apply.    "]},
{"date": "2019-09-13 14:28", "link": "https://newyork.craigslist.org/que/egr/d/project-manager/6977953378.html", "text": "Project Manager", "compensation": "TBD", "type": "full-time", "address": ["\n        ", "\nPrime Architectural Woodworking Company in NYC looking for an ambitious, positive and long term oriented individual with a minimum 4 years experience as a Project Manager in an Architectural Woodworking Company.", "\nRequirements: Excellent knowledge of technology and materials, work under pressure and high managerial skills. Ability to independently work on large commercial and residential projects. High work ethic and self motivation. Very good people skills. ", "\nPlease email your resume, references and salary expectations.    "]},
{"date": "2019-09-13 15:13", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-electrical-engineer/6977996674.html", "text": "ELECTRICAL ENGINEER", "compensation": "$120,000-130,000", "type": "full-time", "address": ["\n        ", "\nELECTRICAL ENGINEER with BSEE and 5 + years experience", "\nin commercial, residential or healthcare projects. ", "\nPermanent. Full time. Excellent benefits.", "\n", "\nHANK DEVITO", "\n", "\nEmail: Hank11214@hotmail.com", "\nTel: Juliana at 718-449-5745    "]},
{"date": "2019-09-14 08:01", "link": "https://newyork.craigslist.org/fct/egr/d/ridgefield-construction-engineers/6978388472.html", "text": "Construction engineers", "compensation": "Compensation will vary by project", "type": "part-time", "address": ["\n        ", "\nEngineer required to review construction plans for various restaurant fit outs. After review of CAD plans, stamp for submission to city building departments in Connecticut and New York    "]},
{"date": "2019-09-15 12:38", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-junior-draftsman-architect/6979195080.html", "text": "Junior Draftsman/Architect with Purchasing Experience", "compensation": "Commensurate with experience", "type": "full-time", "address": ["\n        ", "\nCommercial and residential construction company based in Manhattan seeks Junior Draftsman/Architect with purchasing experience. Excellent opportunity to gain knowledge of and practical experience in the construction industry.  Strong potential for advancement and additional responsibilities based on performance.", "\n", "\nResponsibilities, Qualifications and Required Skills: ", "\n•\tRead, interpret and prepare architectural and woodworking drawings.", "\n•\tCandidate must have strong knowledge of AutoCAD or other architectural software.", "\n•\tCandidate must be able to produce quality shop drawings for commercial and residential project.", "\n•\tSource materials and contractors for each project.", "\n•\tDevelop network of multiple material vendors and service contractors to facilitate timely construction and the highest quality standards, and to ensure costs remain within budget.", "\n•\tNegotiate pricing and delivery schedules with vendors. Expedite deliveries when necessary.", "\n•\tKnowledge and experience working with construction material vendors in NYC, a big plus.", "\n•\tMust be comfortable working in a high-pressured environment.", "\n•\tMust be self-motivated and take initiative without instructions", "\n•\tEnergetic and dynamic personality a big plus ", "\n", "\n    "]},
{"date": "2019-09-15 17:30", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-draftsman-junior-estimator/6979397365.html", "text": "Draftsman/junior estimator - Architectural  Metals", "compensation": "Compensation based on experience plus commission", "type": "full-time", "address": ["\n        ", "\nEstablished Architectural Metal Fabricator located in South Brooklyn is seeking a highly motivated person to join our team. The successful candidate will have a minimum of 5 years' experience in drafting and assembling shop drawings. The position will require estimating projects with understanding of how to evaluate specifications and drawings, identify requirements, obtain quotes from vendors and subcontractors, calculate quantities and prepare offers that win contracts and return profits.", "\n", "\nRESPONSIBILITIES:", "\n•\tAnalyze blueprints and contract documents to prepare labor & material estimates.", "\n•\tConsult with clients, vendors, and management to discuss estimates and resolve issues.", "\n•\tPrepare estimates for use in selecting vendors or subcontractors.", "\n•\tPrepare estimates for bids, quotes as well as planning, organizing and scheduling work.", "\n•\tMaintain a directory of suppliers, contractors and subcontractors.", "\n•\tFollow up with clients and maintain relationships", "\n", "\nREQUIREMENTS:", "\n•\tStrong math and analytical skills as well as an eye for details.", "\n•\tMust be able to read and understand Contract Documents and Blueprints.", "\n•\tMust be proficient in the use of computers, MS Excel/Word. Auto CAD experience a plus.", "\n•\tStrong communication and interpersonal skills.", "\n•\tExperienced in working independently and in a team.", "\n•\tAbility to effectively prioritize and execute tasks.", "\n•\tMust be able to learn, understand and apply new rules and regulations.", "\n•\tMust be able to meet deadlines.", "\n•\tJob may require field, vendor and client visits.", "\n", "\nSales experience is a plus, can easily qualify for commissions and bonuses.", "\n    "]},
{"date": "2019-09-15 18:41", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-civil-engineers-surveyors/6979440305.html", "text": "CIVIL ENGINEERS & Surveyors - All Levels", "compensation": "Dependent on experience level; Full time with benefits, healthcare, 401k", "type": "full-time", "address": ["\n        ", "\n", "  ", "\n ", "  ", "  \n  ", "\n\nWe have positions for: Civil CAD Designer, Civil Project Engineer, Licensed Civil Engineer, Civil Project Manager, Structural Engineer and Land Surveyor  ", " ", "\n\nPositions open for types of project disciplines: Land Development / Site Development, Transportation Engineering, Water Resources, Structural Engineering and Land Surveying  ", " ", "\n\nFor CONFIDENTIAL CONSIDERATION: ", "\nEmail your resume to: jobs@trabucogroup.com \n", " ", "\nFor full list of Engineering positions, visit us at: ", "\n\n", "\n\n KEYWORDS: civil engineering, site development, land development, grading, drainage, storwmwater, SWPPP, paving, striping, traffic control, transportation, signal, signage, railway, highway design, roadway, water, wastewater, hydrology, hydraulics, earthwork, utility design, water resources, wastewater, Autocad, Civil 3D,  REVIT, StaadPro, Microstation, inroads, ArcGIS, surveying, topos, geotechnical, geotech, GIS, structural, ASCE, EIT, PE, TE, survey, surveying, topos, boundaries, ALTA maps, legal description and plats, Appraisal Maps, Records of Survey, topography, photogrammetry, boundary surveys, construction staking, topcon, leica, carlson subdivision mapping, total station, PLS, RPLS, LSIT, SIT\n    "]},
{"date": "2019-09-16 10:01", "link": "https://newyork.craigslist.org/fct/egr/d/mamaroneck-cad-drafter/6979716985.html", "text": "CAD Drafter", "compensation": "Depends on experience", "type": "full-time", "address": ["\n        ", "\nLooking to add another  Drafter in our team.", "\nWe are fully architectural and engineering firm located in Westchester NY.", "\nMust have minimum of (5) years experience with drafting .", "\nProficient in CAD ,REVID, and other engineering software's.", "\n", "\n", "\nSubmit resume to schedule a interview.", "\nPosition available immediately.    "]},
{"date": "2019-09-16 14:05", "link": "https://newyork.craigslist.org/que/egr/d/astoria-sketchup-2019-crackerjack-wiz/6979946135.html", "text": "◄◄  SKETCHUP 2019 CRACKERJACK WIZ AVAILABLE TO FINISH YOUR 3D PROJECT", "compensation": "Per Project Quote", "type": "contract", "address": ["\n        ", "\n", "    "]},
{"date": "2019-10-02 11:54", "link": "https://newyork.craigslist.org/fct/egr/d/architectural-position-revit-user-needed/6991087016.html", "text": "Architectural Position. REVIT user needed", "compensation": "$$", "type": "contract", "address": ["\n        ", "\nA small architectural practice is looking for a Revit user for various projects. BIM models, CDs and shop drawings. Preferably in Connecticut // Fairfield County.", "\nWork will consist of assisting in drafting of all project phases including field survey, drawings of existing conditions, construction documents. The position will require editing projects based on comments and independent work to meet deadlines.", "\nPlease respond with resume and portfolio sample of work done in REVIT ONLY. ", "\nDocumenting experience for Architectural Experience Program available.    "]},
{"date": "2019-09-16 14:37", "link": "https://newyork.craigslist.org/jsy/egr/d/new-york-system-network-administrator/6979977805.html", "text": "System/Network Administrator", "compensation": "Compensation is based on experience and knowledge.", "type": "contract", "address": ["\n        ", "\nJob Description:", "\nThe IT Network/System Admin Engineer provides overall infrastructure support and network management by assisting with configuring and supporting all network switches, Servers, Clients (Desktops) and SANs. This position will be focused on all of the new construction and handle identification of IT requirements: New IT equipment, configurations, troubleshooting and testing of hardware and software implementations.", "\n", "\nDuties:", "\n", "\n• Provide support for client computing hardware, including but not limited to the hard drive, memory, and peripheral connections.", "\n• Oversee setup and configure workstations to be used in diverse environments, adhering to security requirements and organizational requirements (A/D).", "\n• Provide assistance to engineers (remote/onsite) for the general operation of standard supported software.", "\n• Consult with engineers and team members to provide hardware and software configuration and testing.", "\n• Ensures database applications and interfaces are available via periodic health checks.", "\n• Monitor, configure, support, and troubleshoot desktop and server-based applications on a local and remote level throughout the enterprise.", "\n• Assist in Factory Acceptance Testing and test case execution process.    "]},
{"date": "2019-09-16 14:51", "link": "https://newyork.craigslist.org/stn/egr/d/staten-island-junior-architect/6979990779.html", "text": "Junior Architect", "compensation": "Salary commensurate with experience", "type": "full-time", "address": ["\n        ", "\nEstablished, award winning, multidisciplinary Architectural firm looking for a Junior Architect to become part of our project team.", "\nCandidate must have;", "\n-Minimum of 3 years practical experience ", "\n-Knowledge of NYC Building and Energy Codes", "\n-Working Knowledge of AutoCad", "\n-Strong communication skills", "\n-Ability to work as part of design team    "]},
{"date": "2019-09-11 13:16", "link": "https://newyork.craigslist.org/que/egr/d/woodside-earn-up-to-18-hr-deliver-with/6976391620.html", "text": "Earn up to $18/hr! Deliver with Grubhub - Apply now!", "compensation": "Per order fee + mileage + 100% tips", "type": "contract", "address": ["\n        ", "\n\n        ", "\n    "]},
{"date": "2019-09-06 08:51", "link": "https://newyork.craigslist.org/que/egr/d/ozone-park-structural-steel-estimator/6972573548.html", "text": "Structural Steel Estimator", "compensation": "Salary $70,000.00 annually  Paid Holiday, Sick Days and Vacation.", "type": "full-time", "address": ["\n        ", "\nA Minimum of 3 years of experience in commercial construction structural steel as an estimator. Will prepare construction estimates, specification review, submit proposals, change orders, and coordinate project schedule.", "\n", "\n• Must be able to do a takeoff from Construction Documents and shop drawings.", "\n• Occasional travel to project sites", "\n• Reviewing customer contracts to ensure proper scope and terms", "\n• Managing and monitoring costs for work while maintaining or improving target margins", "\n• Preparation of change orders/invoices/Purchase Orders. ", "\n• Management of projects from start to finish", "\n", "\nApplicants must have excellent communication skills, the ability to work well with others, willing to learn, and a good work ethic.", "\n", "\n", "\n", "\n    "]},
{"date": "2019-09-06 07:01", "link": "https://newyork.craigslist.org/lgi/egr/d/melville-bookkeeper/6972537186.html", "text": "BOOKKEEPER", "compensation": "Salary", "type": "full-time", "address": ["\n        ", "\nGeneral Contracting firm is looking or a full time bookkeeper. Candidates need to have a basic knowledge of accounting and quickbooks. Bachelor's degree is a plus, 3 years experience preferably in the construction industry.", "\nTo apply please send your resume and requirements.", "\n", "\n", "\n    "]},
{"date": "2019-09-06 11:13", "link": "https://newyork.craigslist.org/mnh/egr/d/senior-intermediate-architect/6972682127.html", "text": "Senior/intermediate Architect", "compensation": "Salary based on experience, with generous benefit package", "type": "full-time", "address": ["\n        ", "\nMeridian Design Associates, Architects, P.C. is a medium-sized award-winning and well-published New York City-based architectural firm.  Our practice is quite varied, with both new construction and renovation/interiors, including media and entertainment facilities, corporate work, multi-family residential, and high-end residential.  We are an entrepreneurial, innovative firm which places a strong emphasis on initiative and client service.  We do a substantial number of projects outside New York City, including current jobs in Florida, Connecticut, and New Jersey.", "\nWe place a heavy emphasis on computer tools and require that our professionals have strong digital production skills, including ArchiCAD, Revit, SketchUp and other graphic software.  Presentation and 3D modeling skills are very important.  Microsoft Office (Word, Excel) is a must.", "\n", "\nWe are looking for senior to intermediate staff with 4 or more years   work experience capable of doing production, building law analysis, and design and project management.", "\n", "\nResponsibilities:", "\n•         Intensive interaction with firm principals and teams, as well as with clients, consultants and contractors.", "\n•         Design concepts presentations", "\n•         Design coordination and detailing", "\n•         Attend project meetings, take meeting notes", "\n", "\nRequirements:", "\n•         Degree in Architecture/Interior Design", "\n•         4+ years of project experience in all phases of design", "\n•         Experience in 2D/3D software, including ArchiCAD, Revit, SketchUp and other graphic software (Photoshop, InDesign). Proficiency in ArchiCAD preferred. Microsoft Office (Word, Excel) is a must.", "\n•         Strong graphic and visualization skills to communicate design presentations", "\n•         Strong leadership, communication, organizations skills and the ability to work on multiple projects at the same time.", "\n•         Knowledge of materials, construction techniques, and local building codes", "\nWe provide excellent salary and benefits.", "\n    "]},
{"date": "2019-09-06 12:22", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-part-time-architectural-civil/6972749104.html", "text": "Part time Architectural / Civil Engineering intern (NYC)", "compensation": "Commensurate with experience", "type": "part-time", "address": ["\n        ", "\nSmall Manhattan based construction inspection firm looking for an Intern, preferably an architecture or civil Engineering student/ individual to assist with writing field reports related to construction progress, primarily in Manhattan and Brooklyn. This is a freelance position ranging from 10-20 hours per week, working on construction sites and assisting in preparing progress reports. Experience working with MS office, PDF and good reading writing skills is essential. This part time position provides an invaluable opportunity to learn about architectural and structural design aspects of building construction and means and methods. Availability in the mornings is essential.", "\nPlease submit resume    "]},
{"date": "2019-09-06 13:11", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-handyman-needed-the-jewish/6972798058.html", "text": "HANDYMAN NEEDED @ The Jewish Board", "compensation": "Highly Competitive!", "type": "full-time", "address": ["\n        ", "\n", "    "]},
{"date": "2019-09-06 12:56", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-career-opportunity-in/6972782596.html", "text": "Career Opportunity in Engineering for Immigrant Professionals", "compensation": "Free training in Engineering and IT field with placement assistance!", "type": "full-time", "address": ["\n        ", "\nThe Cooper Union Retraining Program for Immigrant Engineers @ CAMBA  assists immigrant Engineers and IT Professionals who are underemployed or unemployed gain access to higher paying jobs through training and job placement assistance. The program includes courses in information technology and mechanical, electrical and civil engineering taught by Cooper Union faculty and field experts.  All services are free and admission is competitive. ", "\nClasses Available:", "\n", "\nEngineering: ", "\n- OSHA 30 for Construction ", "\n- Heating, Ventilation, Air-Condition & Refrigeration", "\n- Building Operation, Maintenance & Safety Regulations", "\n- National Electrical Code (NEC) & its applications", "\n- Bridge, Highway, Tunnels and Buildings: Professional Practice for Cost Estimating", "\n- Green Building Guidelines & Environmental Safety", "\n- AISC Structural Steel Design ", "\n- ACI Structural Concrete Design", "\n- AutoCAD and Revit", "\n", "\nInformation Technology: ", "\n- Data Architecture Principles, Data Structure and SQL", "\n- Java Programming", "\n- Microsoft .NET and C#", "\n- Software Quality Assurance—Manual Testing", "\n- Software Quality Assurance—Automated Testing", "\n- Linux (UNIX) Administration", "\n- Android Software Development", "\n- Cyber Security", "\n", "\nEligibility Requirements:", "\n- Be born outside of the United States and be authorized to work in the United States", "\n- Have a bachelor's degree or higher and professional experience in the field of engineering, information technology, or a related field from the country of origin (not from U.S)", "\n- Have lived in the U.S. less than five full years", "\n- Be unemployed, underemployed, or working in a field not related to your education", "\n- Have intermediate+ English fluency", "\n- Demonstrate a financial need", "\n- Be highly motivated to pursue professional job search", "\n", "\nYou can learn more about us and apply here:  www.cooper.edu/immigrant-retraining.", "\n", "\nPlease call at 718.226.0437 if you have any additional questions about the program or to determine your eligibility.", "\n    "]},
{"date": "2019-09-06 14:00", "link": "https://newyork.craigslist.org/jsy/egr/d/iselin-mechanical-engineer/6972845171.html", "text": "Mechanical Engineer", "compensation": "55,000-99,000", "type": "full-time", "address": ["\n        ", "\nMEP Design related positions only! Please be sure to have 2+ years of experience designing hvac/plumbing systems for buildings using Revit and AutoCAD. Multiple full-time/direct hire positions at different levels.    "]},
{"date": "2019-09-06 14:41", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-junior-architect-draft-person/6972885474.html", "text": "Junior Architect/Draft person", "compensation": "negotiable based on experience", "type": "full-time", "address": ["\n        ", "\nArchitectural and Engineering firm seeking  Junior Architect/Draft person.", "\nSelf-motivated individual who will interact with our clients .  ", "\nIndividuals should be able to draft floor plans elevations, details and prepare architectural construction documents,", "\nCandidates should be able to work as part of a team as well as independently with limited guidance from senior staff. ", "\nApplicants must have a professional Bachelor's degree from an accredited university.", "\nApplicants must be proficient in AutoCAD, Adobe package, Microsoft Office softwares and 3DSMax.  ", "\n", "\nRequirements: ", "\n•min. 5 years of experience using AutoCAD", "\n•Bachelor's degree related to architectural / engineer ", "\n•Experience with MS Office Suite (Word, Excel, Outlook, and Adobe Acrobat) preferred, InDesign and Photoshop a plus ", "\n•Must be able to understand drawing standards in an architectural setting ", "\n•Highly organized ", "\n•Good verbal and written communication skills ", "\n•Strong attention to detail ", "\n•Ability to self-direct and work independently or with limited supervision", "\nTo Apply:", "\nPlease e-mail your cover letter and resume to the above e-mail with the heading Junior Architect. No phone calls, email only.", "\n", "\n    "]},
{"date": "2019-09-06 14:53", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-architectural-job-captain/6972897008.html", "text": "Architectural Job Captain", "compensation": "Competitive Salary - DOE", "type": "full-time", "address": ["\n        ", "\nSBLM New York office looks for a highly motivated Job Captain who is a team player with excellent REVIT skills. Ideal candidate will be a well-organized, detail-oriented individual who is accustomed to working on and leading the production of multiple projects. ", "\n", "\nResponsibilities include, but not limited to: ", "\nCoordinate and develop construction documents", "\nTake on technically challenging issues with Project Manager", "\nPerform code and zoning analyses", "\nReview and redline drawings", "\nOversee drafters, as required by the project", "\nProduce deliverables without requiring constant supervision", "\nCoordinate meetings with consultants", "\nOrganize and lead site visits and surveys", "\nConduct material research and meet with vendor as necessary, to understand", "\nmaterials and products", "\nTake initiative to complete work", "\n", "\nRequirements:", "\nBachelor’s Degree in Architecture", "\n3+ years’ experience in an Architect’s office working on Commercial/Retail projects", "\nMust be proficient in Revit and other applicable industry software is a must", "\nGeneral understanding of codes and zoning", "\nGeneral knowledge of building details and construction process", "\nPositive attitude and driven to succeed", "\n", "\nCompensation and Benefits:", "\n•\tWe offer a competitive salary and benefits package commensurate with the level of experience and a creative and innovative work environment.", "\n•\tOur benefit package includes Medical/Dental/Vision insurance, 401k Retirement Plan, Flexible Spending, Paid Time Off, Holidays and much more.", "\n•\tOur company culture features professional learning and growth opportunities, rewarding project types to participate in and free ongoing professional educational programs.", "\n", "\nInterested candidates should forward their cover letter and resume ", "\nPlease include Job Captain in the subject. No phone calls, please. ", "\n", "\n    "]},
{"date": "2019-09-06 18:12", "link": "https://newyork.craigslist.org/mnh/egr/d/facade-building-envelope-structural/6973066671.html", "text": "Facade / Building Envelope Structural Engineer", "compensation": "Commensurate with experience", "type": "full-time", "address": ["\n        ", "\n", " ", "\n", " , New York City's leading professional firm dedicated to the preservation of buildings and infrastructure, is seeking a resourceful, skilled structural engineer with 5 to 6 years of building envelope restoration experience if licensed, and 7 to 10 years' experience if not licensed, to join us in executing a growing slate of challenging projects.", " \n\nWe work on an array of building types, including courthouses, schools, universities, churches, and hospitals, and many of New York's most storied landmarks, from Trinity Church to Grand Central Terminal. Our work embraces all components of the building envelope and underlying structure—facades, roofs, windows, and plazas—and the full complement of materials, from historic terra-cotta to high-performance curtain walls. We’re proud to be an industry leader in crucial practice areas like Local Law 11 inspections and repairs. We've won numerous awards, as well as the loyalty of many of the premier public, corporate, and residential clients in the region. ", "\n\nYou’ll work as part of a small team assigned to projects based on synergies between project requirements and the capabilities of each team member. This arrangement offers employees the dual advantages of a small office experience coupled with access to the centralized resources of a larger firm. You'll be supported by some of the most sophisticated technology in the profession, including proprietary computer systems and applications, advanced photography and image processing, and state-of-the-art, non-destructive diagnostic equipment and techniques. ", "\n\nTypically, you’ll participate in all phases of a project from inception through completion: proposal, investigation, construction documents, bid negotiation, and construction administration. You'll have the opportunity to see your designs executed in the field and you'll take on greater responsibility and client management as soon as you are ready. ", "\n\nWe offer an array of benefits and growth opportunities: :", "\n", "\n\nOur light-filled Tribeca office is in a landmarked building with 16' high ceilings, 8' tall windows, and stunning views of Manhattan in three directions—not a bad place to spend the work day. We’re easily accessible via public transportation: the A, C, and E Canal Street station connects directly to our building’s lobby. The N, R, 1, and 6 lines are all just a few blocks away. ", "\n\nIf you’re excited about this opportunity, please send us your resume, a cover letter with salary requirements, and a few pages of attachments (maximum of 10MB, please) or link to your portfolio that demonstrates your experience and capabilities. ", "\n\nWith thanks for your interest, please note that only those candidates under consideration will be contacted. ", "\n\nFor additional information on our firm’s services, approach, and projects, visit ", "\n    "]},
{"date": "2019-09-06 18:13", "link": "https://newyork.craigslist.org/mnh/egr/d/facade-building-envelope-architect/6973067281.html", "text": "Facade / Building Envelope Architect", "compensation": "Commensurate with experience", "type": "full-time", "address": ["\n        ", "\n", " ", "\n", " , New York City's leading professional firm dedicated to the preservation of buildings and infrastructure, is seeking a resourceful, skilled architect with 2 to 5 years of building envelope restoration experience to join us in executing a growing slate of challenging projects.", " \n\nWe work on an array of building types, including courthouses, schools, universities, churches, and hospitals, and many of New York's most storied landmarks, from Trinity Church to Grand Central Terminal. Our work embraces all components of the building envelope and underlying structure—facades, roofs, windows, and plazas—and the full complement of materials, from historic terra-cotta to high-performance curtain walls. We’re proud to be an industry leader in crucial practice areas like Local Law 11 inspections and repairs. We've won numerous awards, as well as the loyalty of many of the premier public, corporate, and residential clients in the region. ", "\n\nYou’ll work as part of a small team assigned to projects based on synergies between project requirements and the capabilities of each team member. This arrangement offers employees the dual advantages of a small office experience coupled with access to the centralized resources of a larger firm. You'll be supported by some of the most sophisticated technology in the profession, including proprietary computer systems and applications, advanced photography and image processing, and state-of-the-art, non-destructive diagnostic equipment and techniques. ", "\n\nTypically, you’ll participate in all phases of a project from inception through completion: proposal, investigation, construction documents, bid negotiation, and construction administration. You'll have the opportunity to see your designs executed in the field and you'll take on greater responsibility and client management as soon as you are ready. ", "\n\nWe offer an array of benefits and growth opportunities: :", "\n", "\n\nOur light-filled Tribeca office is in a landmarked building with 16' high ceilings, 8' tall windows, and stunning views of Manhattan in three directions—not a bad place to spend the work day. We’re easily accessible via public transportation: the A, C, and E Canal Street station connects directly to our building’s lobby. The N, R, 1, and 6 lines are all just a few blocks away. ", "\n\nIf you’re excited about this opportunity, please send us your resume, a cover letter with salary requirements, and a few pages of attachments (maximum of 10MB, please) or link to your portfolio that demonstrates your experience and capabilities. ", "\n\nWith thanks for your interest, please note that only those candidates under consideration will be contacted. ", "\n\nFor additional information on our firm’s services, approach, and projects, visit ", "\n    "]},
{"date": "2019-09-07 10:34", "link": "https://newyork.craigslist.org/brk/egr/d/steel-detailer/6973397500.html", "text": "Steel Detailer", "compensation": "pay based on experience", "type": "full-time", "address": ["\n        ", "\nStructural Steel and Miscellaneous Iron Fabricator is seeking a experienced in house steel detailer. ", "\n", "\nMust be proficient with 3-d modeling programs such as TEKLA,and/or ADVANCE STEEL. ", "\n", "\nWe offer a highly competitive salary with year end bonus.", "\n", "\nIf you are interested in working for a growing, aggressive company, e-mail your resume with salary requirements    "]},
{"date": "2019-09-07 10:59", "link": "https://newyork.craigslist.org/que/egr/d/long-island-city-construction-estimator/6973417789.html", "text": "Construction Estimator", "compensation": "Salary commensurate with experience", "type": "full-time", "address": ["\n        ", "\nAIK Renovations is a fast growing commercial and residential construction company in the metropolitan New York area. We are actively seeking experienced Estimators for employment in our Long Island City office .", "\n", "\n-Candidates must have experience estimating construction projects in the local area.", "\n", "\nOther Requirements Include:", "\n", "\n-Knowledge of the construction industry (both residential and commercial), with a focus on interior renovation work.", "\n", "\n-Must be able to multitask and effectively manage multiple projects simultaneously.", "\n", "\n-Excellent written and verbal communication skills and meticulous attention to detail are requirements.", "\n", "\n-Must be able to work independently and as part of a dynamic team.", "\n", "\n-Be able to review and perform full breakdowns of construction drawings, specifications and bid forms. Gather all material quotes and or sub-contractor quotes necessary to construct cost estimates.", "\n", "\n-Ability to create project schedules/timelines.", "\n", "\n-Develop the scope of work for sub-contractors and assist in the buy-out procedures.", "\n", "\n-Complete understanding of subcontracting and procurement strategies.", "\n", "\n-Must have several years of successful experience in the field to be hired.", "\n", "\n", "\nAbout AIK Renovations:", "\nAIK is a leading commercial and residential contractor based in New York City. Incorporating the highest quality materials and state-of-the-art construction techniques in conjunction with superior project coordination and construction supervision, AIK strives to surpass our clients’ expectations while delivering unique projects on time and within budget.    "]},
{"date": "2019-09-08 09:17", "link": "https://newyork.craigslist.org/wch/egr/d/harrison-junior-and-intern-architect/6974014420.html", "text": "Junior and Intern Architect", "compensation": "Salary will be directly related to ability and performance.", "type": "full-time", "address": ["\n        ", "\nJunior and Intern Level Architect", "\nHarrison, New York ", "\nSmall Architectural firm seeking to fill positions for full-time and part time Junior Architect / Intern. Work directly under licensed professional. Contribute to residential, commercial, and industrial projects. The right candidate should be hard working willing to learn the field of architecture, and reliant.  Great experience for candidate who is working toward or possess a bachelor in Architecture with some prior experience. The office is in Harrison NY four blocks from train station.", "\n", "\nWe seek motivated, bright, and responsible individuals with:", "\n• Strong communications skills", "\n• Working towards or possess a bachelor degree in Architecture", "\n• Detail oriented and organized", "\n• Ability to work independently", "\n• Willing to learn", "\n• Skilled in Collaboration and able to take Direction from the Team", "\nSoftware Requirements: ", "\n• AutoCAD 2014 a must", "\n• Sketchup", "\n• Microsoft Office", "\n• Photoshop a plus", "\n", "\nInterested candidates should e-mail a cover letter, work examples and resume. Resumes must include a phone number and the city/town of residence. ", "\nCompensation: Salary will be directly related to ability and performance. ", "\nEmployment type: Full-time & Part-time", "\n", "\n    "]},
{"date": "2019-09-08 14:48", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-assistant-cm-estimator-admin/6974234174.html", "text": "Assistant CM/ Estimator/ Admin for Developer/ CM", "compensation": "TBD", "type": "full-time", "address": ["\n        ", "\nCM/ Developer in better Condo, Townhouse and Commercial work seeks experienced Administrator with strong background and abilities in both Estimating and Administration.", "\n", "\nResponsibilities are varied and include", "\n", "\n•\tBudgets and Estimating", "\n o\t]Outline and Schedule Estimating requirements for On Time Delivery.", "\n o\tSet up Excel Workbooks with Trade Pages and Summary for CSI Estimates and Developer Budgets.", "\n o\tOrganize and Distribute Bid Packages to Contractors and Vendors and Follow-up.", "\n o\tTakeoffs for Carpentry, Millwork, Finishes and other Trades", "\n o\tGenerate Tender Reports for Lender Compliance.", "\n o\tAssemble information from various sources including Consulting Estimators, Trade Vendors and Self.", "\n", "\nAdministrative", "\n", "\n o\tMaintain Site Reports in conjunction with Foremen and Site Superintendents", "\n o\tAttend Site Meetings and Distribute Meeting Minutes.", "\n o\tG703 Payment Applications for Trade Contractors", "\n o\tContractors Progress Reports", "\n o\tLender Reports and associated documentation and Photo Presentations", "\n o\tTrack and Facilitate Sign Offs", "\n", "\nGeneral Skills", "\n", "\n o\tMust Write and Speak well.", "\n o\tHigh proficiency in Excel", "\n o     Proficiency in Microsoft Project, Smartsheet or similar Excel Based Scheduling Programs.", "\n o\tMinimum 10 years’ experience or 5 Years plus related Education.", "\n", "\nPlease respond with Resume, availability and Salary Requirements. If you list your Salary Requirements as “Negotiable” we will not respond.", "\n", "\nImmediate", "\n    "]},
{"date": "2019-09-08 23:26", "link": "https://newyork.craigslist.org/fct/egr/d/dover-afb-3-junior-engineers/6974526705.html", "text": "3 Junior Engineers", "compensation": "To be discussed with the Hiring Manager", "type": "contract", "address": ["\n        ", "\nPlanate Management Group is a Service-Disabled Veteran-Owned Small Business (SDVOSB) headquartered in Alexandria, Virginia, USA with a technical support center in the Philippines that provides program management and facilities engineering services worldwide. Planate is a small business provider of planning, design, infrastructure management, technical consulting, engineering, and construction management services in support of the US Department of Defense (DOD) and its Service missions (Army, Air Force, Navy, Marine Corps), along with other US federal agencies.", "\n", "\nThe Junior Engineers will be responsible for assisting the squadron with several construction/repair projects which consist all aspects of engineering works to support the Air Force Base in Dover, Delaware. ", "\n", "\nThis position is contingent on the award of the contract. Contract duration will be one year plus two option years.", "\n", "\nKey responsibilities:", "\n•\tPerforms planning and design work for substantial multi-phase new construction, renovation, and improvement projects for a variety of real property facilities, including utility systems, utilizing a professional knowledge of (electrical/ Mechanical/ Civil) engineering. Orchestrates the planning, design, cost estimating and phased scheduling of assigned projects including completion of required project forms and economic analyses", "\n•\t Serves as consulting engineer on all design aspects of assigned projects but specifically knowledgeable and qualified to review and approve engineering details of projects.", "\n•\tCoordinates the preparation of and reviews statements of work (SOW)", "\n•\tReviews Design-Build and Design-Bid-Build packages and works with contracting personnel as a technical expert to negotiate Government construction contracts", "\n•\tCoordinates projects with engineers in other disciplines or with architects", "\n•\tKeeps abreast of emerging technologies to ensure programmed development will not prematurely become obsolete", "\n•\tComplies with health, safety, and environmental rules and procedures and performs work in a manner that enhances safety of the work environment", "\n•\tPerforms other responsibilities associated with this position as may be appropriate.", "\n", "\nQualifications to be successful in the role:", "\n", "\n•\tRequired personnel:  Degree in (1) Electrical Engineer (1) Civil Engineer (1) Mechanical Engineer ", "\n•\tEngineering Degree OR minimum of two (2) years work experience in respective discipline", "\n•\tAble to perform tasks in a team environment", "\n•\tProficient with Microsoft Office products and able to adapt to other software used to manage and track assigned projects ", "\n•\tProficient in English both written and oral", "\n•\tMust be US Citizen.", "\n", "\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, sex or national origin.", "\n    "]},
{"date": "2019-09-09 11:07", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-intermediate-senior-interior/6974740601.html", "text": "Intermediate/Senior Interior Designer", "compensation": "Competitive based on years of experience and design skill", "type": "full-time", "address": ["\n        ", "\nDowntown design studio, teeming with new work seeks an Intermediate and Senior Designer to work alongside Creative Director on new local residential developments. Firm has deep-rooted connections within leading NYC development community, and working on ambitious projects of varying scale. This is an opportunity for motivated designers to be hands-on in creating narratives/concepts, and build schemes through project install. ", "\n", "\nThe role requires strong concept and design development experience. Must be able to work with clients, build storylines, and develop comprehensive schemes, with great attention to FF&E. Must be able to produce some furniture and DD plans in AutoCAD, but position is more creatively focused. ", "\n", "\nTaste level and knowledge of FF&E are critical. Demonstrated success presenting to clients is a plus. Ability to coordinate and manage vendors, fabricators, consultants in meetings and on-site are required. 3-7+ years of professional experience. ", "\n", "\nSubmit resume and portfolio samples for immediate response.    "]},
{"date": "2019-09-09 00:29", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-asst-project-designer/6974543245.html", "text": "Asst Project Designer / Office Manager", "compensation": "Base Salary 55-65k plus overall package", "type": "full-time", "address": ["\n        ", "\n***Our apologies, but the responses that we recieved over the last few weeks were deleted in error.  If you have previously applied, please feel free to resend your information and thank you!", "\n", "\n", "\nAssistant Project Designer / Office Manager at The Renovated Home., which is located at our showroom at 401 East 76th Street, New York, NY 10021.", "\n", "\nPosition Duties:", "\n• Manage all facets of the operations of the office and design studio. Inventory management, supplies, etc. ", "\n• Fully involved in all facets of projects underway, coordination with the project designers on staffing and subcontractor", "\non upcoming projects.", "\n• Handle and coordinate all facets of service work for past clients through completion.", "\n• Involvement on scheduling throughout the trades and vendors on all ongoing projects.", "\n• Monitor, organize, shadow and follow up on all emails sent to Our presidents TRH mailbox.", "\n• Continually oversee the vendors and add contractors and sourcing to our team as appropriate and available.", "\n• Liaison with clients as needed.", "\n• Tracking / Scheduling / and coordinating site meetings throughout the project process as well as management of the", "\nproject", "\n", "\n", "\n", "\nPlease send resume and any pertinent information that might give us a sense of what makes you the ROCKSTAR we are looking for! ", "\n", "\n    "]},
{"date": "2019-09-09 13:06", "link": "https://newyork.craigslist.org/brk/egr/d/design-fabrication-shop-looking-for-cad/6974861440.html", "text": "Design/Fabrication Shop looking for CAD/CAM Specialist", "compensation": "commensurate with experience, on W2, paid vacation, sick time, holidays", "type": "full-time", "address": ["\n        ", "\nWe are a small shop in Williamsburg specializing in fine art fabrication, product development, engineering, prototyping, and making almost anything. ", "\n", "\nDuties:", "\n", "\n-Build 3D models in Solidworks/Rhino/Fusion360", "\n-Create sheet layouts from Illustrator/dxf files", "\n-Generate CAM files from models/drawings", "\n-Load and run CNC mill and router", "\n-Create shop drawings & technical control drawings", "\n-Basic assembly and finishing", "\n", "\n", "\nRequirements:", "\n", "\n-Must have minimum 1 year experience using CNC machines (machine setup, file generation, operation). VisualMill / Fusion360 preferred.", "\n-Minimum 1 year experience using 3D modeling software. Solidworks / Fusion360 preferred.", "\n-Experience using various power tools (drills, saws, sanders, etc)", "\n", "\n", "\nPlease send resume and portfolio for consideration.", "\n", "\nInstagram: @rushdesignnyc", "\n", "\nWeb: www.rushdesign.net    "]},
{"date": "2019-09-09 14:04", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-architect-interior/6974920380.html", "text": "Architect/ Interior Designer", "compensation": "Base on experience", "type": "full-time", "address": ["\n        ", "\nRADU ARCHITECTS is seeking full-time Architect/ Interior Designer with 5- 7 years' experience in all aspects of design and production. Candidate must be able to manage more than one project at one time varying in size.", "\nCandidate should have experience in dealing with clients.", "\nCandidate should have good design sense and be knowledgeable in construction documents. The Architect will be responsible for all or some of the project phases such as; Schematic Design, Design Development, Construction Documents, Custom Millwork Detail and Shop Drawings Review.", "\nPrerequisites:", "\n1.\t5-7 years' experience working for a NYC Architectural Firm/ Interior Design firm.", "\n2.\tProficient in producing CD's ", "\n3.\tProject Management/Consultants coordination.", "\n4.\tClient relations experience", "\n5.\tGood design sense.", "\n6.\tTechnical knowledge of NYC building codes and NYC zoning.", "\n7.\tNY Professional License a plus.", "\nCandidate Qualifications:", "\n1.\tExcellent oral and written communication skills.", "\n2.\tProficient in creating coordinated construction document sets.", "\n3.\tResolves technical and code issues.", "\n4.\tOrganize, schedule and administer project constructability schedule.", "\n5.\tProduce Schematic Design Proposals.", "\n", "\n    "]},
{"date": "2019-09-09 17:17", "link": "https://newyork.craigslist.org/que/egr/d/civil-engineer-student-wanted-entry/6975097406.html", "text": "Civil Engineer/Student Wanted - Entry Level Position", "compensation": "To be discussed", "type": "full-time", "address": ["\n        ", "\nLooking for a worker at a construction company based in Astoria:", "\nJob opening for a Civil engineer, at entry level position. ", "\nWe will provide comprehensive on the job training.", "\n", "\nRequirements are as follows: ", "\nTeam work, ", "\nMust be able to elaborate bids and estimates, ", "\nMust be able to generate and read blue prints, ", "\nMust be able to work under pressure and meet all deadlines.", "\nAUTOCAD great plus.", "\n", "\nPlease email resume.", "\n    "]},
{"date": "2019-09-10 10:57", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-structural-engineers-needed/6975508123.html", "text": "Structural Engineers Needed!", "compensation": "Competitive salary, comprehensive benefits, 401K, structured bonus program", "type": "full-time", "address": ["\n        ", "\nMurray Engineering is rapidly growing, and we are seeking highly motivated Structural Engineers to join our team! Our diverse portfolio consists of new construction as well as renovations/alterations to existing buildings. We have a large client base that provides us with a wide array of projects that include commercial, cultural,institutional, retail, and single/multi-family residential properties as well as special structures.", "\n", "\nWe are dedicated to using an innovative design and team-oriented approach that contributes to the success of our clients, the growth of our employees and a positive impact in our community.", "\n", "\nOur firm offers a competitive salary, comprehensive benefits, 401K, structured bonus program, and opportunities for advancement. Our employees are encouraged to participate in professional development groups and activities.", "\n", "\nPositions available require the following:", "\n*Excellent written and verbal communication skills.", "\n*Bachelor’s degree in civil engineering with a structural concentration.", "\n*Master’s degree in Civil or Structural Engineering preferred, but not required.", "\n*FE/EIT certification, preferred.", "\n*1-5 years of experience.", "\n*Strong attention to detail with excellent analytical and judgment capabilities required.", "\n*Well-organized.", "\n*Ability to effectively work independently and in a team environment required.", "\n*Strong computer skills.", "\n*Passion for problem solving and responsibility.", "\n", "\n    "]},
{"date": "2019-09-10 11:23", "link": "https://newyork.craigslist.org/mnh/egr/d/architect-intermediate/6975531688.html", "text": "Architect, Intermediate", "compensation": "Commensurate with experience", "type": "full-time", "address": ["\n        ", "\nTribeca office seeks intermediate Architect for work including new commercial and residential construction.  This is a great opportunity for professional growth with exposure to all aspects of architectural practice.  Candidate must be knowledgeable, with good communication skills, and must be willing and able to take on responsibility.  Vectorworks a plus.", "\n", "\nSend resume, portfolio less than 3MB, availability, salary requirements    "]},
{"date": "2019-09-10 11:28", "link": "https://newyork.craigslist.org/mnh/egr/d/revit-bim-operator/6975536506.html", "text": "REVIT / BIM Operator", "compensation": "Competitive...based on previous experience.", "type": "contract", "address": ["\n        ", "\nLeading national provider of building measurement services is seeking a qualified BIM Operator / Draftsperson with high level of work experience in Revit. ", "\n", "\nCandidates for this position require previous experience accurately capturing and drafting \"as-built\" environments and conditions in REVIT. Position requires the ability to collaborate with our team, measure and produce Revit model for both commercial and residential projects nationwide. Ability to use 3D laser scanner a plus - but not a requirement.  ", "\n", "\nKindly email resume along with three (3) examples of previous Revit work in PDF format. ", "\n", "\n    "]},
{"date": "2019-09-10 13:09", "link": "https://newyork.craigslist.org/brx/egr/d/bronx-construction-mechanical-inspector/6975632362.html", "text": "Construction Mechanical Inspector", "compensation": "Based on experience", "type": "full-time", "address": ["\n        ", "\nWe are seeking a graduated mechanical engineer to conduct building inspections pertaining to TR1 forms for the Dept. of Buildings for new buildings and alteration jobs.", "\n", "\nThe ideal candidate:", "\n", "\n- Must have a mechanical engineering degree.", "\n", "\n- Must be knowledgeable of the building code", "\n", "\n- Must be reliable and willing to travel to all the 5 boroughs of NYC", "\n", "\n- Must have or be willing to obtain ICC mechanical certification", "\n", "\n- Must be able to read and understand construction plans", "\n", "\nPay: TBD with experience", "\n", "\n    "]},
{"date": "2019-09-10 17:25", "link": "https://newyork.craigslist.org/que/egr/d/woodside-earn-up-to-18-hr-deliver-with/6975862859.html", "text": "Earn up to $18/hr! Deliver with Grubhub - Apply now!", "compensation": "Per order fee + mileage + 100% tips", "type": "contract", "address": ["\n        ", "\n\n        ", "\n    "]},
{"date": "2019-09-11 11:31", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-architectural-designer/6976291274.html", "text": "Architectural Designer", "compensation": "Commensurate w/ experience", "type": "full-time", "address": ["\n        ", "\nBWArchitects is a multi-disciplinary firm that specializes is high end residential, hospitality and special events. Our projects are based in NYC, California and Europe. We have exciting new opportunities and are looking for a key member to join our team.", "\n", "\nQualifications: ", "\n", "\nProfessional degree in Architecture (required)", "\n3 - 5 years of post graduate experience in NYC", "\nSTRONG design, technical and graphic skills", "\nEXCELLENT organizational and communication skills", "\nModel making experience a PLUS", "\n", "\nOur work tools are Mac based Vectorworks, Sketchup, Rhino, Maxwell Render and the Adobe Creative Suite. Knowledge of the Mac OS and programs is not required but a is a big plus.", "\n", "\nWe are searching for a candidate who will be the right fit for our company culture.", "\n", "\nWe are a design and detail oriented firm with a rigorous approach to our work. Our clients are important and so are our families. ", "\n", "\nMore info about us at www.bw-architects.com", "\n", "\nIf interested, please email us your resume and samples of relevant experience, graphic and technical and the dates when you are available to start work.", "\n", "\nThe position comes with an immediate start date but we will wait for the right candidate. Salary is dependent on experience. Range 65k-80k", "\n    "]},
{"date": "2019-09-11 11:38", "link": "https://newyork.craigslist.org/mnh/egr/d/architectural-model-shop-manager/6976297796.html", "text": "Architectural Model Shop Manager", "compensation": "$6,000 / month", "type": "contract", "address": ["\n        ", "\nWe are searching for a skilled architectural model maker to manage our model shop and oversee several projects. We employ the use of a laser cutter and 3d printer.", "\n", "\nExpected employment duration: Through November 2019 with the possibility for other work beyond.", "\n", "\nBWArchitects is a multi-disciplinary firm that specializes is high end residential, hospitality and special events. Our projects are based in NYC, California and Europe. We are a design and detail oriented firm with a rigorous approach to our work. Our clients are important and so are our families.", "\n", "\nCheck out the WORKSHOP section on our website: www.bw-architects.com", "\n", "\nIf interested, please email us your resume and samples of relevant experience, technical knowledge and the dates when you are available to start work.    "]},
{"date": "2019-09-11 13:20", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-architectural-fall-internship/6976396605.html", "text": "Architectural Fall Internship – Student or Recent Graduate", "compensation": "One time -Stipend: - $1,400 Full Time / $1,100.00 Part Time", "type": "employee's choice", "address": ["\n        ", "\nKushner Studios is an award-winning architecture & interior design firm. Our current projects include high-end residential & commercial projects, with a fast-growing reputation as the \"Go to\" firm for breweries and restaurant design. (www.kushnerstudios.com) (", ")", "\nThe internship program at Kushner Studios aims to provide aspiring architects/interior designers/artists/ with little, or no professional background and still attending a relevant university program, or recent graduates the opportunity to gain real-world experience in a multifaceted architectural firm.", "\n", "\nDescription and Responsibilities\u2028", "\nWorking in a creative, fast past paced and professional setting, the internship training provides the chance to apply the knowledge gained in an educational environment to the many diverse tasks typically found in a design-build business. Interns will be considered part of the learning team, responsible for supporting project managers, they will be asked to perform a variety of tasks under the direct observation and/or supervision of a Kushner Studios employee, some with specific deadlines that are crucial to the project.", "\n", "\nOur office is unique in several aspects: the most obvious is our facility and organization, both broadminded and broadly presented approach to project management & construction; With design projects that span Residential, Commercial, Hospitality and Institutional, we hope this internship finds much applicability in your future careers.", "\n", "\nRequirements\u2028", "\nCandidates currently enrolled in or recently graduated from an accredited architectural program must be enthusiastic and motivated with a working knowledge of Word and Excel, rendering skills in Vector works or AutoCAD a plus.", "\n", "\nRemuneration: One time -Stipend: - $1,400 Full Time / $1,100.00 Part Time", "\nHours per Week: - Minimum 18 hrs (Part Time) - 28hrs (Full Time)\u2028", "\nEmployment Start Date: - September 16th, 2019 or as soon as possible.", "\nEmployment End Date: 12 weeks\u2028- 15 weeks ", "\nEnrolled in or recently graduated from an accredited architectural program.", "\n", "\nApplication Instructions:", "\nEmail Resume, Portfolio, and cover letter.  Files larger than 5MB will not be considered.    "]},
{"date": "2019-09-12 12:40", "link": "https://newyork.craigslist.org/mnh/egr/d/junior-intermediate-architectural/6977100182.html", "text": "Junior & Intermediate Architectural Designers", "compensation": "Commensurate with Experience", "type": "full-time", "address": ["\n        ", "\nKGA is a small, twenty-nine year old firm based in Chelsea with a wide array of projects, including commercial, institutional, multi-family residential, single-family residential, and temporary installations. Employees experience all aspects of design, from Schematics through Construction Administration.", "\n", "\nKossar + Garry Architects, LLP (KGA), is looking for a talented and creative individual to fill two Architectural Designer positions:", "\n(1) 1-2 years of U.S. experience.", "\n(1) 3 years and above of U.S. experience.", "\n", "\nRequirements:", "\n- Minimum Bachelors of Architecture.  Only applicants with Bachelors of Architecture will be considered.", "\n- Professional Revit Experience.", "\n- Strong graphic skills required, including expertise in AutoCAD, Revit, Rhino, Adobe Creative Suite, and 3D modeling software.", "\n- Ability to communicate fluently in English, verbally and in writing, with clients, consultants and contractors, is essential.", "\n- Strong multi-tasking and organizational skills are required.", "\n- Word and Excel familiarity is a plus.", "\n- Familiarity with NYC Zoning and Building Codes is a plus.", "\n", "\nPlease send your resume and work samples in PDF format, max of 5mb.", "\nInclude SALARY requirement on your cover letter.", "\n", "\n    "]},
{"date": "2019-09-16 14:55", "link": "https://newyork.craigslist.org/stn/egr/d/staten-island-handyman-porters-needed/6979995190.html", "text": "HANDYMAN & PORTERS NEEDED IN STATEN ISLAND", "compensation": "Highly Competitive!", "type": "full-time", "address": ["\n        ", "\n", "    "]},
{"date": "2019-09-11 19:42", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-seeking-junior-to-intermediate/6976711289.html", "text": "Seeking Junior to Intermediate Architect” / Architectural Designer", "compensation": "Commensurate with experience", "type": "full-time", "address": ["\n        ", "\nSeeking Junior to Intermediate Architect” / Architectural Designer", "\n", "\nNA Design Studio is a small and dynamic design firm based in Brooklyn working on a wide range of high end projects including multi-family residential, offices and institutional buildings. We take pride in our designs and collaborate in an energetic studio environment and incorporate a systematic, yet open minded approach with all of our projects. ", "\n", "\nWe are seeking a full time “Junior to intermediate architect” that has extreme passion for both the design and technical aspects of Architecture to work closely with project leadership and design team in an energetic collaborative environment. This team position offers great opportunities with long term growth potential, working directly with the principal on projects from design to construction with responsibilities to include: ", "\n", "\nResponsibilities:", "\n", "\nDevelop projects from schematic-design, design development, construction documents to construction coordination", "\nDevelop design concepts, sketches, layouts and design presentations", "\nManage workflow of projects, organize and maintain records. ", "\nDevelop construction documents from design drawings and under supervision of senior staff", "\nResearch, analyze and implement zoning and building code requirements", "\nCoordinate and develop details based on construction documents", "\nCoordinate throughout the DOB plan examination process to coordinate approvals.", "\nConstruction site visits to review progress as well as to create as-built plans and drawings.", "\n", "\nQualifications:", "\n", "\nArchitectural degree required (B. Arch or M. Arch)", "\nGood understanding of construction documents is a must, with a minimum of 4 years of construction document development and coordination experience.", "\nHighly proficient in AutoCAD and in computers in general. Architectural desktop experience a plus, and other industry accepted software also desired", "\nExcellent communication skills, verbally and in writing is a must, with ability to communicate with clients, contractors and consultants.", "\nMust be reliable, extremely organized, resourceful, self motivated and able to work in groups or independently, with ability to multi-task and meet deadlines. ", "\nUnderstanding of building construction, zoning and building code ", "\n3D modeling and rendering, photoshop and graphic presentations skills a plus", "\n", "\n", "\nThanks in advance to those who apply for taking the time to share your work with us.", "\n    "]},
{"date": "2019-09-17 12:11", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-architect-designer/6980589501.html", "text": "Architect/Designer", "compensation": "Compensation commensurate with experience", "type": "full-time", "address": ["\n        ", "\nWe are an established and awarded small architectural firm located in Manhattan. Our projects cover public buildings and educational facilities. We are looking to hire talented individuals who have the potential and ambition for growth towards positions in office leadership.", "\nOur office organization enables staff members a hands-on experience. Working on multiple projects and different phases of work, including design, construction documents and job administration. Our transparent office environment provides exposure to all aspects of the practice.", "\nQualifications:", "\n•\tBe a US citizen or be permitted to work in the USA", "\n•\tProfessional degree in Architecture", "\n•\tSkill in Autocad and presentation software. Revit capability a plus.", "\n•\tUSA experience in design, detailing and construction administration.", "\n•\tVerbal and writing abilities.", "\nWork description:", "\n•\tParticipate in the design and production of multiple projects at all design and project administration phases.", "\n•\tAttend site meetings and prepare minutes. Observe and document progress and quality of construction work.", "\n•\tCommunicate with in-house staff, consultants and clients.", "\n•\tDemonstrate skill in the use of drafting and presentation software.", "\n", "\nWe offer competitive salaries, health coverage and profit sharing.", "\nInterested candidates should email a cover letter, resume, work samples and requested compensation in PDF format.", "\n    "]},
{"date": "2019-09-17 11:05", "link": "https://newyork.craigslist.org/que/egr/d/flushing-structural-engineer/6980527453.html", "text": "Structural Engineer", "compensation": "The salary is based on level of experience.", "type": "full-time", "address": ["\n        ", "\nJob Description:", "\n", "\nWe are currently seeking structural engineers at multiple levels to join our team. As a structural engineer, you will work with other team members in our highly collaborative environment to assure that designs are developed in accordance with appropriate codes and standards, quality control objectives are achieved, and project goals are met within the schedule and budget. This is an outstanding opportunity for a structural engineer to work on a variety of high-profile projects throughout the region. ", "\n", "\nDuties and Responsibilities:", "\n", "\n- Coordinate with architects, contractors, owners, and other engineers from the initial planning stages through final construction.", "\n- Determine design criteria using relevant codes and standards.", "\n- Analyze and/or prepare models and calculations for various structural elements and systems by using various software and/or hand calculations.", "\n- Develop contract documents, including construction drawings and technical specifications", "\n- Produce schematic and detailed designs and evaluation of planning and concept alternatives", "\n- Review shop drawings, RFI's.", "\n- Perform field inspections and write inspection reports.", "\n", "\nSkills and Qualifications:", "\n", "\n- Familiar with latest version of AutoCAD, Revit, ETABS, SAP2000, SAFE, RAM, Excel.", "\n- Excellent verbal and written communication skills", "\n- Ability to effectively work independently and collaboratively in a team environment", "\n- Must be eligible to work in the United States", "\n", "\nEntry Level Candidates:", "\n- Bachelor’s degree in Civil or Structural Engineering.", "\n", "\nIntermediate Level Candidates:", "\n- Master’s degree in Civil or Structural Engineering.", "\n- 3+ years of related work experience in concrete or steel framing building structural design, support-of-excavation and foundation system design, steel or concrete rebar shop drawing design, construction support design and field inspection.", "\n", "\nAdvance Level Candidates:", "\n- Master’s degree in Civil or Structural Engineering.", "\n- 8+ years of related work experience in concrete or steel framing building structural design, support-of-excavation and foundation system design, steel or concrete rebar shop drawing design, construction support design and field inspection.", "\n- NYS PE License", "\n", "\n", "\n", "\n    "]},
{"date": "2019-09-17 15:01", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-project-manager/6980754347.html", "text": "Project Manager", "compensation": "Compensation to be determined based on knowledge and experience.", "type": "full-time", "address": ["\n        ", "\nJob Purpose Summary:", "\n ", "\nThe Project Manager is responsible to manage and consult on multiple construction-consulting projects through project closeout or consulting resolution.  The Project Manager, along with the Senior Project Manager, will act as Beacon’s main client contacts for the project(s).   Beacon provides construction consulting services which include construction management, assisting surety companies with assessment/completion of troubled construction projects, cost estimating, claim analysis, and assessment of construction defects.", "\n", "\nKey Responsibilities: ", "\n", "\n•\tCommunicating with the project contacts (ie:  client, obligee, principal, attorneys, subcontractors and vendors) on a day-to-day basis", "\n•\tAttending project meetings", "\n•\tInvestigating and assessing construction projects", "\n•\tAnalyzing and preparing the project cost to complete reports", "\n•\tEstablishing reserve recommendations", "\n•\tDeveloping completion strategies", "\n•\tPreparing project status reports for client", "\n•\tPreparing bid packages", "\n•\tAnalyzing construction claims", "\n•\tReviewing payment bond claims ", "\n•\tRatifying subcontractor agreements ", "\n•\tMonitoring the completion of projects through closeout", "\n•\tPreparing and analyzing project schedules ", "\n•\tNegotiating change orders and claims", "\n•\tReviewing work of the Project Engineer", "\n", "\nExperience Required:", "\n", "\n•\tAccredited degree in Engineering or Construction Management", "\n•\tMinimum of 5 years experience in engineering or construction management of public work projects such as roadways, schools or public transportation and/or large commercial construction projects such as universities, hospitals or hotels ", "\n•\tConstruction accounting/estimating background required", "\n•\tHas demonstrated success in managing or the potential to manage large construction projects", "\n•\tExtremely proficient in MS Office software, especially Word, Excel and PowerPoint", "\n•\tKnowledge of Primavera Scheduling software is a plus", "\n•\tCADD experience preferred", "\n•\tStrong leadership and decision-making skills", "\n•\tStrong communication, organization and analytical skills ", "\n•\tSelf-motivated and capable of handling multiple projects", "\n", "\nIf interested, please contact:", "\nKaren Anderson, Business Manager", "\nBeacon Consulting Group, Inc.", "\nkanderson@beacon.ws", "\n    "]},
{"date": "2019-09-17 16:05", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-local-law-11-inspector-engineer/6980811212.html", "text": "Local Law 11 Inspector / Engineer", "compensation": "based on experience", "type": "full-time", "address": ["\n        ", "\nEstablished mid-size structural engineering design firm in the Flatiron District of Manhattan, New York City with a wide variety of projects focused on new constructions and renovations for both small- and large-scale residential and commercial buildings in the tri-state area.", "\nThe Intermediate Level Local Law 11 Inspector position is for someone in the Structural/Civil Engineering or Architectural field with at least 3 years of experience and knowledge, who possesses a well-organized and detail-oriented solid background in conducting site visits to do inspections for Local Law 11. The candidate should be able to organize and put together complete sets of construction documents as well as coordinating with architectural and other consultants, clients and contractors. Additionally, the candidate should be able to produce reports containing photographs and text.", "\nThis position is a great opportunity for experience and growth!", "\nPlease submit resume/cover letter, work samples and salary requirements by email.", "\nJob Type:", "\n•\tFull-time", "\nJob Location:", "\n•\tNew York, NY", "\nRequired Education:", "\n•\tBachelor’s (minimum)", "\nWork Authorization:", "\n•\tUnited States (required)", "\nRequired Language:", "\n•\tFluent in English", "\nRequired Knowledge of Software:", "\n•\tMicrosoft Office Word and Excel", "\n•\tDrafting/AutoCAD", "\n•\tETABS, SAFE, RAMS Structure, ASDIP Suites, ENERCAL", "\n•\tKnowledge of Revit a plus, but not required", "\nPreferred Traits:", "\n•\tAbility to take direction, work independently, and handle changing and evolving directives.", "\n•\tAble to prioritize & concurrently service multiple projects & meet deadlines.", "\n•\tBe a team player and have the ability to complete tasks accurately and efficiently.", "\n•\tEffective problem solving & interpersonal skills & the ability to interface with all clients & employees.", "\n•\tInteracts well with other disciplines & clients in a manner that builds productive relationships.", "\n•\tStrong ability to detail and manage the production of multiple complex projects at the same time.", "\n•\tDetail-oriented to ensure that plans and sections coordinate, eliminating inaccuracies during production.", "\n    "]},
{"date": "2019-09-17 15:49", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-mechanical-hvac-engineer/6980797403.html", "text": "Mechanical - HVAC Engineer", "compensation": "Open", "type": "full-time", "address": ["\n        ", "\nMechanical - HVAC Engineer for small NYC Consulting firm. Must be proficient in AUTOCAD. ", "\nP.E. or P.E. qualified preferred.", "\nFax your resume to (646) 357-9735    "]},
{"date": "2019-09-17 18:13", "link": "https://newyork.craigslist.org/mnh/egr/d/facade-building-envelope-structural/6980912776.html", "text": "Facade / Building Envelope Structural Engineer", "compensation": "Commensurate with experience", "type": "full-time", "address": ["\n        ", "\n", " ", "\n", " , New York City's leading professional firm dedicated to the preservation of buildings and infrastructure, is seeking a resourceful, skilled structural engineer with 5 to 6 years of building envelope restoration experience if licensed, and 7 to 10 years' experience if not licensed, to join us in executing a growing slate of challenging projects.", " \n\nWe work on an array of building types, including courthouses, schools, universities, churches, and hospitals, and many of New York's most storied landmarks, from Trinity Church to Grand Central Terminal. Our work embraces all components of the building envelope and underlying structure—facades, roofs, windows, and plazas—and the full complement of materials, from historic terra-cotta to high-performance curtain walls. We’re proud to be an industry leader in crucial practice areas like Local Law 11 inspections and repairs. We've won numerous awards, as well as the loyalty of many of the premier public, corporate, and residential clients in the region. ", "\n\nYou’ll work as part of a small team assigned to projects based on synergies between project requirements and the capabilities of each team member. This arrangement offers employees the dual advantages of a small office experience coupled with access to the centralized resources of a larger firm. You'll be supported by some of the most sophisticated technology in the profession, including proprietary computer systems and applications, advanced photography and image processing, and state-of-the-art, non-destructive diagnostic equipment and techniques. ", "\n\nTypically, you’ll participate in all phases of a project from inception through completion: proposal, investigation, construction documents, bid negotiation, and construction administration. You'll have the opportunity to see your designs executed in the field and you'll take on greater responsibility and client management as soon as you are ready. ", "\n\nWe offer an array of benefits and growth opportunities: :", "\n", "\n\nOur light-filled Tribeca office is in a landmarked building with 16' high ceilings, 8' tall windows, and stunning views of Manhattan in three directions—not a bad place to spend the work day. We’re easily accessible via public transportation: the A, C, and E Canal Street station connects directly to our building’s lobby. The N, R, 1, and 6 lines are all just a few blocks away. ", "\n\nIf you’re excited about this opportunity, please send us your resume, a cover letter with salary requirements, and a few pages of attachments (maximum of 10MB, please) or link to your portfolio that demonstrates your experience and capabilities. ", "\n\nWith thanks for your interest, please note that only those candidates under consideration will be contacted. ", "\n\nFor additional information on our firm’s services, approach, and projects, visit ", "\n    "]},
{"date": "2019-09-17 18:15", "link": "https://newyork.craigslist.org/mnh/egr/d/facade-building-envelope-architect/6980913889.html", "text": "Facade / Building Envelope Architect", "compensation": "Commensurate with experience", "type": "full-time", "address": ["\n        ", "\n", " ", "\n", " , New York City's leading professional firm dedicated to the preservation of buildings and infrastructure, is seeking a resourceful, skilled architect with 2 to 5 years of building envelope restoration experience to join us in executing a growing slate of challenging projects.", " \n\nWe work on an array of building types, including courthouses, schools, universities, churches, and hospitals, and many of New York's most storied landmarks, from Trinity Church to Grand Central Terminal. Our work embraces all components of the building envelope and underlying structure—facades, roofs, windows, and plazas—and the full complement of materials, from historic terra-cotta to high-performance curtain walls. We’re proud to be an industry leader in crucial practice areas like Local Law 11 inspections and repairs. We've won numerous awards, as well as the loyalty of many of the premier public, corporate, and residential clients in the region. ", "\n\nYou’ll work as part of a small team assigned to projects based on synergies between project requirements and the capabilities of each team member. This arrangement offers employees the dual advantages of a small office experience coupled with access to the centralized resources of a larger firm. You'll be supported by some of the most sophisticated technology in the profession, including proprietary computer systems and applications, advanced photography and image processing, and state-of-the-art, non-destructive diagnostic equipment and techniques. ", "\n\nTypically, you’ll participate in all phases of a project from inception through completion: proposal, investigation, construction documents, bid negotiation, and construction administration. You'll have the opportunity to see your designs executed in the field and you'll take on greater responsibility and client management as soon as you are ready. ", "\n\nWe offer an array of benefits and growth opportunities: :", "\n", "\n\nOur light-filled Tribeca office is in a landmarked building with 16' high ceilings, 8' tall windows, and stunning views of Manhattan in three directions—not a bad place to spend the work day. We’re easily accessible via public transportation: the A, C, and E Canal Street station connects directly to our building’s lobby. The N, R, 1, and 6 lines are all just a few blocks away. ", "\n\nIf you’re excited about this opportunity, please send us your resume, a cover letter with salary requirements, and a few pages of attachments (maximum of 10MB, please) or link to your portfolio that demonstrates your experience and capabilities. ", "\n\nWith thanks for your interest, please note that only those candidates under consideration will be contacted. ", "\n\nFor additional information on our firm’s services, approach, and projects, visit ", "\n    "]},
{"date": "2019-09-18 13:29", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-if-you-are-looking-for/6981407011.html", "text": "If you are looking for a rewarding Mechanical Technician Career", "compensation": "Varies on experience", "type": "full-time", "address": ["\n        ", "\nIf you are looking for a rewarding Mechanical Technician Career", "\nCOME JOIN US AT OUR Next JOB FAIR, YOU'RE INVITED!!!", "\nON THE SPOT INTERVIEWS. IF YOU ATTEND YOU WILL BE INTERVIEWED.", "\n", "\n", "\nDate : Sunday September 22, 2019", "\nTime: 2pm- 5pm", "\nLocation :  Carousall", "\nRoom: Training Room", "\nConey Island, Brooklyn, NY 11224", "\nWe are looking to HIRE amazing people who will make lifetime memories for themselves and our guest. If you believe that person is you, feel free to bring a RESUME in hand.", "\n", "\nJob Description", "\n", "\nMaintain, erect, repair and troubleshoot electro-mechanical equipment and ensure their safe operation. The Mechanical Technician will perform inspections and troubleshoot electro-mechanical equipment. Ensure that the electro-mechanical equipment is kept clean and compliant with manufacturers specifications, industry standards, and corresponding government agencies", "\nSKILLS:", "\n-Must have at least 3 years of prior experience in the maintenance, troubleshooting, and repair of mechanical/electro-mechanical systems.", "\n-Able to comprehend and execute inspection procedures.", "\n-Experience in using instrumentation i.e. Multimeter, caliper, and others", "\n-Prior experience with Programmable Logic Controllers (PLC’s) or Relay logic is a plus.", "\n-Candidates must possess a strong work ethic and be safety conscious", "\n-Candidates must possess the ability to read, write and communicate in English to sufficiently perform the key duties of the Maintenance Technician.", "\n-Other optional skills are the following; experience in welding, machining and the understanding of electrical/hydraulic/pneumatic schematics and control systems.", "\nPHYSICAL DEMANDS:", "\n", "\n", "\n", "\nMust be able to work in all weather conditions including exposure to direct sunlight.", "\nMust be able to lift, carry, move, and/or position items weighing up to or in excess of 75 pounds.", "\nMust be able to lift 80 pounds consistently and carry over 25 feet of various surfaces", "\nMust be able to lift and lower 25 pounds above shoulder level", "\nAble to work at heights over 120 ft.", "\n", "\nReports to: Maintenance Manager/ Director", "\n", "\nJob Type: Full-time", "\nPlease bring your resume with you and be Dressed professional.", "\n    "]},
{"date": "2019-09-18 16:48", "link": "https://newyork.craigslist.org/que/egr/d/flushing-drafter-estimator-experienced/6981585804.html", "text": "Drafter/Estimator Experienced in steel fabrication", "compensation": "15+++", "type": "full-time", "address": ["\n        ", "\nWe are seeking an in house person experienced in miscellaneous steel fabrication to detail our incoming jobs and do takeoffs for bidding on projects as well.Must be experienced. Please reply in detail for interview,thanks.    "]},
{"date": "2019-09-18 17:20", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-trainee-project-manager-at/6981611591.html", "text": "Trainee Project Manager at High-End Glass Wall Company", "compensation": "$3750/month", "type": "full-time", "address": ["\n        ", "\nHi! Thanks for your interest, please check out the details below, and if it seems like the right position for you, feel free to reach out with any questions:", "\n", "\nJOB DESCRIPTION", "\nWing Partners is looking for an energetic person to join our training program to become a Project Manager. No project management experience is necessary to join as a trainee. You'll learn everything from experienced project managers who manage multi-million dollar projects, building workplaces for fortune 500 companies. We specialize in glass wall systems for office interiors. (Check out our website for photos www.wingpartners.com). Please note that this is not a design role, and you should have some architecture, engineering or construction training.", "\n", "\nYou will be consulting with designers on the customization capabilities of our wall systems and coordinating the build-out of our clients' designs. You will interact with architects, especially during the drafting of shop drawings and submitting finish samples for approval. You'll assist our Project Managers in the office and in the field on active jobsites with reviewing bid requests, drafting and submitting shop drawings, and following the entire project timeline from bidding to completion.", "\n", "\nRESPONSIBILITIES", "\n* Review construction documents, put together bid packages", "\n* Develop shop drawings in AutoCAD (or Revit if you know it)", "\n* Field verification measurements", "\n* Attend construction coordination meetings", "\n* Assist with scheduling of deliveries and supervision of installers", "\n", "\nREQUIREMENTS", "\n* Proficiency in AutoCAD, Excel and Word. ", "\n* Experience with Revit is a plus, but not required.", "\n* Be able to read and understand construction documents", "\n* Must be able to communicate with clients as well as general contractors and field labor.", "\n* Self-driven, detail oriented, well organized.", "\n* Located in the NYC metro area", "\n", "\nCOMPENSATION AND TIME", "\n40 hours per week, with a salary paid bi-weekly. Typical hours are 9am-6pm, with occasional meetings starting at 8am. Training program lasts 90-180 days depending on performance. Health benefits are available after a waiting period of 60 days. With excellent performance you'll graduate from Trainee to full Project Manager, which includes a pay raise.", "\n", "\nABOUT US", "\nWing Partners is a full-service distributor of modern, high-end customized glass wall systems. We work closely with architects and interior designers to help them achieve their visions for the workplaces of clients such as IBM, Under Armour, AMC, Heineken, Coach, NBA, Nike, and many more. At Wing Partners, we're a small tight-knit group who works hard and likes to have fun. We're based in Chelsea, New York City.", "\n", "\nCONTACT", "\nCheck out our website at WingPartners.com. To apply, please email Michael with your resume/cv, cover letter and 'your name - Wing Partners' in the subject. Thanks!    "]},
{"date": "2019-09-18 17:25", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-mechanical-engineer-for/6981615644.html", "text": "Mechanical Engineer for Rapidly Growing Med Device Company", "compensation": "TBD", "type": "contract", "address": ["\n        ", "\n(*Boston to Nashua area only* -- will pay to relocate the right person)", "\n", "\nROM3 is a three-year-old medical technology company that has created and patented a revolutionary orthopedic rehabilitation device (see our product video at www.rom3rehab.com). We have been well-funded, having raised $19.1 million to date and are currently planning for a public offering within the next nine months.", "\n", "\nWe are looking for an exceptional consultant Mechanical Engineer in the Boston to Nashua area (Northern MA Southern NH) for a 4-8 week project. The Candidate is expected to help with the finalization and transfer to production of a unique post-surgery rehabilitation device. Must be familiar with electro-mechanical assemblies and plastic molded parts and able to hit the ground running. The successful applicant will be assisting our lead designer to move from prototype to production in record time, hence experience and productivity are key. Possible longer-term involvement for the right match.", "\n", "\nIn addition to the skills and competencies described below, we seek candidates who are open, honest and candid. Compensation is based on experience, accomplishments, and proven success in this role.", "\n", "\nThe Mechanical Engineer will have:", "\n•\tA passion for simple and elegant mechanical design", "\n•\tA portfolio of design work", "\n•\tExperience developing and refining prototypes", "\n•\tExperience designing for manufacturing at scale", "\n•\tAn ability to work well under pressure to meet aggressive deadlines", "\n•\tHighly proficient with CAD (Solidworks) – solid modeling, assemblies, drawing generation", "\n•\tExperience with BOM generation, revision control", "\n•\tMinimum of 8+ years experience in mechanical engineering", "\n•\tStrong oral and written communication skills.", "\n", "\nAdditional consideration if you have:", "\n•\tPrevious start-up experience", "\n•\tDeveloped mechanical medical devices", "\n•\tDeveloped exercise equipment", "\n•\tHands-on experience with fabrication (CAM, CNC etc)", "\n", "\nQualified candidates, please respond via email to this ad and include:", "\n•\tA cover letter detailing why you are a great fit for this job. Please state your current hourly pay requirement.", "\n•\tAn up-to-date resume", "\n", "\nThank you for your interest.", "\n    "]},
{"date": "2019-09-18 17:29", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-architect/6981618883.html", "text": "ARCHITECT", "compensation": "fee per job", "type": "contract", "address": ["\n        ", "\nlooking for a architect with NYS licence and registered in NYC to review and consult construction drawings for  legality and work together on the job.", "\nPlease send you resume along with your licence #    "]},
{"date": "2019-09-18 17:55", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-seeking-permit-expeditor/6981638283.html", "text": "Seeking Permit Expeditor (Tribeca)", "compensation": "Depends on Expertise", "type": "full-time", "address": ["\n        ", "\nArchitectural and Permit Expediting firm of 29 years located in Tribeca is seeking full-time permit expeditor, Class 2 preferred. You will be filing in multiple boroughs and traveling between our office and various city agencies. Must be a reliable and professional individual in good standing with DOB and other agencies. Please reply through the Craigslist email relay with a resume and contact info. Thanks!    "]},
{"date": "2019-09-18 20:41", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-part-time-architectural-civil/6981740285.html", "text": "Part time Architectural / Civil Engineering intern (NYC)", "compensation": "Commensurate with experience", "type": "part-time", "address": ["\n        ", "\nSmall Manhattan based consulting / inspection firm looking for an Intern, preferably an Architecture , Civil engineering or Interior design student / individual to assist with writing field reports related to construction progress, primarily in Manhattan and Brooklyn. This is a freelance / part time position ranging from 10-30 hours per week, working on construction sites and assisting in preparing progress reports. Experience working with MS office, PDF and good reading writing skills is essential. This part time position provides an invaluable opportunity to learn about architectural and structural design and construction aspects of all types of buildings, from residential townhouses, penthouses, to commercial and retail building retrofit. Availability in the mornings is essential.", "\nPlease submit resume    "]},
{"date": "2019-09-18 21:10", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-office-assistant/6981754878.html", "text": "Office Assistant", "compensation": "Based on experience", "type": "full-time", "address": ["\n        ", "\nLooking for Office assistant for Professional firm, experience in Corporate office required. Responsible for overall front office activities, answering calls and support the internal staff. Typing letters, maintaining logs. Must be reliable, punctual, organized, and have demonstrated ability to handle multiple priorities in a very busy office. Excellent interpersonal skills, pleasant phone manner and proficient in Word, Excel and Outlook are required.", "\nQualifications: Good organizational skills, Professional appearance, at least two years of previous experience in office management. Excellent knowledge of MS Office. Pay based on experience. Full benefits package.    "]},
{"date": "2019-09-19 10:42", "link": "https://newyork.craigslist.org/mnh/egr/d/office-assistants-and-autocad-draft/6981979950.html", "text": "Office Assistants and AutoCad Draft persons", "compensation": "Compensation based upon experience", "type": "full-time", "address": ["\n        ", "\nLicensed Architect Firm in Chinatown and Flushing seeks Architect Office Assistants and Architectural designers to prepare DOB related paper work or drawings.  Architectural background and experience in NYC Zoning and Building Code is a plus.   Need strong computer skills and great communication skills in English and Chinese.  Please do not apply if you will be short-term or part time.  Training will be provided if needed. ", "\n", "\nPlease send resume and salary request for interview.    "]},
{"date": "2019-09-19 11:11", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-design-engineer-draftsperson/6982004871.html", "text": "Design Engineer / Draftsperson", "compensation": "Long term career opportunity with competitive starting salary and paid holidays. We are a Drug Free Employer.", "type": "full-time", "address": ["\n        ", "\nConstruction firm seeking Design Engineer / Draftsperson for glass and aluminum related work. ", "\nApplicants must be proficient in AutoCAD, Adobe package, Microsoft Office softwares, etc ", "\nExperience is preferred but is not required. Must speak English and Russian. Must be able to visualize what is being drawn and be very detail oriented and careful. You will be in charge of taking architectural design plans and doing shops drawings as well create order list and bills of materials. Must be punctual and diligent.", "\n", "\n    "]},
{"date": "2019-09-19 12:10", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-nys-registered-architect/6982058034.html", "text": "NYS Registered Architect", "compensation": "to be discussed", "type": "contract", "address": ["\n        ", "\nLooking for NYS Registered Architect to join our team to review and consult design documents for DOB And construction as design applicant, Ideally you have experience in residential architecture in NYC, some knowledge of NYC DOB and LPC, please send resume along with your licences #    "]},
{"date": "2019-09-19 14:06", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-intermediate-architect/6982164127.html", "text": "Intermediate Architect", "compensation": "65+DOE", "type": "full-time", "address": ["\n        ", "\nWe are a midsize firm established in NYC over 30 years ago.  We have a wide array of projects, but we specialize in hospitality projects.  Employees of our firm are able to experience all aspects of design, from Schematics through Construction Administration.", "\n", "\nWe are looking for a couple intermediate architects:  ", "\n", "\nRequirements:", "\n- Bachelors of Architecture. ", "\n- Experience in Construction Documents", "\n- Experience in Construction Administration", "\n- Knowledge of Construction Methods", "\n- Knowledge of NYC DOB Codes", "\n- Experience with complex, mid and hi-rise buildings, new construction and renovations", "\n- Strong Autocad ability and speed required", "\n- Ability to communicate fluently in English, verbally and in writing, with clients, consultants and contractors, is essential.", "\n- Strong multi-tasking and organizational skills are required.", "\n", "\nPlease send your resume and any work samples in PDF format", "\nPlease include salary requirement in your cover letter.    "]},
{"date": "2019-09-19 15:40", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-senior-healthcare-designer/6982246779.html", "text": "Senior Healthcare Designer/Studio Director", "compensation": "salary commensurate with experience", "type": "full-time", "address": ["\n        ", "\nSBLM Architects is currently seeking a Senior Healthcare Designer. ", "\nCandidate must display excellent creative and visual presentation skills along with good communication and management skills.", "\n", "\nJob Responsibilities:", "\n•\tManages design process for entire project; leads/directs the work of other", "\ndesigners and technical staff", "\n•\tDefines program requirements and establishes design parameters based on", "\nclient requirements", "\n•\tCreates and develops overall design concepts, formulates design presentation", "\nstrategies and makes compelling presentations", "\n•\tManages design team members during the implementation of design to ensure the intent and quality of concept is maintained throughout project delivery", "\n•\tManages client interaction and decision making related to design", "\n•\tMonitors project budget and schedule related to design team efforts", "\n•\tParticipate in business development and marketing activities", "\n", "\nRequirements:", "\n•\tApplicant should have a minimum of 5 years of experience and be proficient in AutoCAD.", "\n•\tApplicant should have a thorough understanding of Healthcare programming, conceptual layouts, equipment planning and material & finish selections. ", "\n•\tApplicant should have working knowledge of graphic rendering programs including 3D Studio Max, Photoshop and Sketch Up.", "\n•\tBachelor Degree in Architecture or BS in Architecture Tech. is required.", "\n", "\nCompensation and Benefits:", "\n•\tWe offer a competitive salary and benefits package commensurate with the level of experience and a creative and innovative work environment.", "\n•\tOur benefits package includes Medical/Dental/Vision insurance plans, 401k Retirement, Flexible Spending Plan and much more.", "\n•\tOur company culture features professional learning and growth opportunities, rewarding project types to participate in and free ongoing professional educational programs.", "\n    "]},
{"date": "2019-09-19 17:38", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-construction-project-manager/6982340069.html", "text": "Construction Project Manager ( Denver, CO)", "compensation": "$40 to $50 per hour.", "type": "full-time", "address": ["\n        ", "\nJob Location: Denver, Colorado", "\n", "\nJob Duration: Base plus four option years. Total 5 years", "\n", "\nMinimum Education: ", "\n", "\n4-year degree in architecture, landscape architecture, mechanical, civil, electrical, structural, geotechnical or general engineering or construction management.", "\n", "\nMinimum Experience: 4 years Project Management experience as follows:", "\n", "\n“Field work”, including practices and procedures of candidates’ specific discipline, such as engineering, landscape architecture, architecture, or resource planning.", "\nManagement of simple-to-complex design and construction projects containing multi-year phasing and overlapping schedules, high visibility, multiple functions (design, construction, planning), controversy, unusual design/construction components with novel problems requiring unique solutions, significant political interest/oversight, and jurisdictional disputes", "\nKnowledge of project management concepts, and understanding of authorities, responsibilities, and accountabilities of the \"project management philosophy\".", "\nWritten and verbal communication, problem-solving, and conflict resolution skills", "\nKnowledge of contract administration and compliance", "\nKnowledge of software including Microsoft Project, Word and Excel", "\nPositive attitude and ability to get along with diverse groups of people", "\n", "\nPerformance Requirements:", "\n", "\nAssists the Project Manager (PM) as a technical point of contact for assigned projects. Supports PM in cradle-to-grave project execution and completion of assigned tasks from design through construction.", "\nCoordinates with various stakeholders and team members through all phases of a project. During design, coordinates with other key staff/expertise and reviews A/E firms’ execution and deliverables (design drawings, specifications, supplemental reports, cost estimates, inspection and trip reports, etc.). During construction, coordinates project needs with construction management (CM) firms, construction contractors, and other NPS (Park and Region) staff.", "\nAssists PM in maintaining project compliance, quality, scope, budget and programming criteria.", "\nIdentifies problems and coordinates solutions with the PM, resolves technical and schedule issues as needed, and develops corrective actions to ensure successful project accomplishment.", "\nPerforms workload outside of the candidate’s specific discipline.", "\nTravels occasionally for on-site inspections, investigations, and meetings often requiring a significant amount of walking, bending and climbing. Field trips are often in the outdoors and may experience weather extremes, insect bites, varied topography and other physical demands.    "]},
{"date": "2019-09-19 18:22", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-junior-architect-draft-person/6982370182.html", "text": "Junior Architect/Draft person", "compensation": "negotiable based on experience", "type": "full-time", "address": ["\n        ", "\nArchitectural and Engineering firm seeking Junior Architect/Draft person.", "\nSelf-motivated individual who will interact with our clients . ", "\nIndividuals should be able to draft floor plans elevations, details and prepare architectural construction documents,", "\nCandidates should be able to work as part of a team as well as independently with limited guidance from senior staff. ", "\nCandidates should have project management in exterior renovation  experience. ", "\nApplicants must have a professional Bachelor's degree from an accredited university.", "\nApplicants must be proficient in AutoCAD, Adobe package, Microsoft Office softwares and 3DSMax. ", "\n", "\nRequirements: ", "\n•min. 5 years of experience using AutoCAD", "\n•Bachelor's degree related to architectural / engineer ", "\n•Experience with MS Office Suite (Word, Excel, Outlook, and Adobe Acrobat) preferred, InDesign and Photoshop a plus ", "\n•Must be able to understand drawing standards in an architectural setting ", "\n•Highly organized ", "\n•Good verbal and written communication skills ", "\n•Strong attention to detail ", "\n•Ability to self-direct and work independently or with limited supervision", "\nTo Apply:", "\nPlease e-mail your cover letter and resume to the above e-mail with the heading Junior Architect. No phone calls, email only.    "]},
{"date": "2019-09-20 13:56", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-architect-engineer/6982876499.html", "text": "Architect  Engineer", "compensation": "Competitive Salary according to experience", "type": "full-time", "address": ["\n        ", "\nArchitectural firm based in NYC looking for a couple of intermediate architects:", "\n", "\nRequirements:", "\n", "\n- Bachelors of Architecture is a Bonus", "\n- NYC Registered License Required.", "\n- Experience in Construction Documents", "\n- Experience in Construction Administration", "\n- Knowledge of Construction Methods", "\n- Knowledge of NYC DOB Codes", "\n- Experience with complex, mid and hi-rise buildings, new construction and renovations", "\n- Autocad & Revit ability and speed appreciated", "\n- Ability to communicate fluently in English, verbally and in writing, with Engineers, consultants and contractors, is essential.", "\n- Strong multi-tasking and organizational skills are required.", "\n", "\nPlease send your resume and any work samples in PDF format", "\nPlease include salary requirement in your cover letter.    "]},
{"date": "2019-09-20 14:23", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-architect-engineer-mid/6982902668.html", "text": "Architect/Engineer (mid-level)", "compensation": "Based on experience", "type": "full-time", "address": ["\n        ", "\nDuring our 30 years of operation we have provided expert architectural and engineering services on over 3,000 projects ranging from residential high rise developments, brownstones, hotels, office buildings, commercial spaces, Areas of Public Assembly, and restaurants. Our firm provides a full range of architectural, engineering and design for structural and MEP work, new construction, demolition, facade repair and waterproofing, as well as commercial and residential renovations.", "\n", "\nWe are mid-sized company with a relaxed but highly motivated work environment. It is a great place to hone your talents and learn new skills.", "\n", "\nRequired skills:", "\nProficiency in Autocad/Autodesk", "\n5 years experience in preparation of architectural/engineering plans and construction documents", "\nExcellent time management and organizational skills ", "\nExcellent oral and written communication  ", "\nAbility to set priorities and to work independently and as a part of a team.", "\nAbility to travel to work sites in five boroughs", "\nKnowledge of NYC building codes and DOB procedures", "\n", "\nResponsibilities:", "\nDevelop all phases of design-construction documents.", "\nAssist in the preparation of estimates, change orders and field reports", "\nReview bid packages, shop drawings, material submissions, and schedules and follow up with appropriate trades", "\nOn site inspection of construction work.", "\nOrganize and lead site visits and surveys", "\nPrepare written site inspection reports", "\n", "\nPlease email resume.    "]},
{"date": "2019-09-20 15:19", "link": "https://newyork.craigslist.org/que/egr/d/project-manager/6982955918.html", "text": "Project Manager", "compensation": "TBD", "type": "full-time", "address": ["\n        ", "\nPrime Architectural Woodworking Company in NYC looking for an ambitious, positive and long term oriented individual with a minimum 4 years experience as a Project Manager in an Architectural Woodworking Company.", "\nRequirements: Excellent knowledge of technology and materials, work under pressure and high managerial skills. Ability to independently work on large commercial and residential projects. High work ethic and self motivation. Very good people skills. ", "\nPlease email your resume, references and salary expectations.    "]},
{"date": "2019-09-20 15:21", "link": "https://newyork.craigslist.org/que/egr/d/estimator/6982957261.html", "text": "Estimator", "compensation": "TBD", "type": "full-time", "address": ["\n        ", "\nPrime Architectural Woodworking Company in NYC looking for an experienced, ambitious, positive and long term oriented individual.", "\nRequirements:", "\nExcellent knowledge of wood technology and materials. Ability to independently work on large commercial and residential projects. High work ethic and self motivation. Very good people skills.", "\nExcellent working conditions, atmosphere, pay and benefits.", "\nPlease email your resume, references and salary requirements.", "\nOnly candidates from woodworking industry please apply.    "]},
{"date": "2019-09-20 15:53", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-project-administrator/6982985650.html", "text": "Project Administrator", "compensation": "Negotiable", "type": "full-time", "address": ["\n        ", "\nEstablished mid-sized NYC architectural firm is seeking a full-time Project Administrator with experience in architecture industry to join our dynamic,multi-disciplinary team. Applicants should be highly organized and motivated and demonstrate design sensibility. Successful candidates will work closely with Senior Principal on projects of various types.", "\n", "\n", "\nSkills& Qualifications:", "\n", "\n- 3-5 years minimum experience in architecture industry required", "\n- A general understanding of architecture practice and project phases", "\n- Ability to interpret architectural drawings preferred", "\n- Understanding of project scheduling", "\n- Bachelor’s Degree, ideally with a Major in Architecture", "\n", "\n", "\nResponsibilities:", "\n", "\n- Work with team members in the production of contract and proposal documents", "\n- Monitor budgets and schedules, identify potential shortfalls and take necessary action to prevent negative impact on critical path", "\n- Interact with various levels of design team, subcontractors, and vendors, as well as clients", "\n- Provide project-related administrative support to Senior Principal, including scheduling meetings, preparing correspondence, preparing meeting agendas, taking meeting notes, preparing reports", "\n- Perform other duties and responsibilities as required", "\n", "\n", "\nThe ideal candidate will:", "\n", "\n- Have the ability to manage time, tasks, and people", "\n- Possess excellent problem solving and decision-making skills", "\n- Thrive in a fast-paced environment and have the ability to multi-task", "\n- Be detail-oriented, efficient, and adaptable to changing deadlines and priorities", "\n- Have strong organizational skill and communication skills", "\n- Demonstrate enthusiastic commitment to our team-focused environment", "\n- Have a willingness to learn and take direction from Seniors", "\n- Have experience working on a wide range of project types", "\n", "\n", "\nFirm provides competitive salary, health benefits, profit-sharing and 401(k).    "]},
{"date": "2019-09-20 15:22", "link": "https://newyork.craigslist.org/que/egr/d/draftsman-assistant-project-manager/6982958179.html", "text": "Draftsman, Assistant Project Manager", "compensation": "TBD", "type": "full-time", "address": ["\n        ", "\nA reputable Architectural Woodworking Company is looking for a full time draftsman/assistant project manager position. Only solid, professional and long term oriented please apply. This position requires excellent knowledge of AUTOCAD. Only experienced in the field apply. Please email your resume, references and salary expectations    "]},
{"date": "2019-09-21 16:41", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-intermediate-architect/6983724129.html", "text": "intermediate architect", "compensation": "salary", "type": "full-time", "address": ["\n        ", "\nIntermediate Architectural Designer", "\n", "\nNew York, NY", "\n", "\nWCA – West Chin Architect is an award-winning / published architecture and interior design firm in downtown Manhattan, seeking a mid-level architectural designer (4-6 year experience minimum in high end modern residential). Majority of our work is executing high end residential design, from ground up construction to loft renovations to townhouses. In addition, we design for commercial clients, hospitality and retail.   We have a furniture / accessory line and a recently-opened 2 retail stores, one in the Hamptons and one on Fifth Avenue.", "\n", "\nRESPONSIBILITIES", "\n", "\nThe designer will act as team member under the direction of the Project Manager and will collaborate with the Principal. He or she is a team member in the design of a project from conceptualization, through development, coordination, documentation and execution in the field.", "\n", "\nThe Designer’s core responsibilities are:", "\n", "\nDesign", "\n", "\n    As part of the team, prepare designs to meet the clients’ objectives, project constraints, and execution of the firm’s design vocabulary and philosophy, with limited supervision required.", "\n    Research materials, prepare programming diagrams and design presentations, including mood boards and quick 3D hand sketches as needed to convey the design intent.", "\n", "\nDevelopment", "\n", "\n    Assist on the development of the whole project keeping in mind WCA’s vocabulary, client goals and senior directives.", "\n    Review documents to ensure they incorporate and accurately reflect the design intent.", "\n    Mentor and assist junior designers.", "\n", "\nCoordination", "\n", "\n    Represent the firm and the design in consultant coordination meetings.", "\n    Participate in design coordination within firm i.e. between architecture, decorators and graphics, and between clients, consultants and the firm.", "\n    Liaise with vendors and manufacturers.", "\n", "\nDocumentation", "\n", "\n    Work as a team to create and deliver presentations and contract documents based on the firm’s standards.", "\n    Produce and deliver quality and timely sets of contract documents, including drawings, specifications, sample boards, and reports as required for each unique project.", "\n    Review own work for corrections, improvement and overall professional development.", "\n", "\nExecution", "\n", "\n    Respond to RFIs and resolve issues and problems that arise during construction.", "\n    Review submittals, shop drawings, substitutions and field conditions for conformance with the design.", "\n    Attend and report on field visits.", "\n    Conduct punch lists reviews.", "\n", "\nREQUIREMENTS", "\n", "\n    BA/BS minimum degree required.  A minimum of (4-6) years’ experience at an architecture or interior design firm, preferably in NYC high end residential / commercial design.", "\n    Strong skills in creating BD and CD sets with a clear understanding of modern residential high-end detailing.", "\n    Fluency in all Microsoft Office applications, Adobe Creative Suite, AutoCAD; Fluency in Sketchup and 3DMax is desirable, though not required.", "\n    Must be able to work in a collaborative, proactive and multi-tasking environment.", "\n    An important aspect of this position is having a discerning eye for design and a particular interest and experience in high end modern residential", "\n    Must be able to listen, interpret, communicate and articulate our design to a client while balancing the needs and expectations of the clients.", "\n    Must be a self-sufficient, critical thinker able to anticipate the next steps.", "\n", "\nIf you meet the above requirements, please send your resume, 3 email references, portfolio samples as PDF attachments (maximum 3MB) and your salary request.    "]},
{"date": "2019-09-21 11:04", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-landscape-design-assistant/6983442087.html", "text": "Landscape Design assistant project manager and admin.", "compensation": "Base salary training $500/wk with increase with bonus system higher pay for experienced workers", "type": "full-time", "address": ["\n        ", "\nGrowing Landscape team and Garden Design company is seeking good people for full time and possible **flex time employment. ", "\n", "\nAre you working on the labor crew but think you want to help organize and manage? ", "\n", "\nA trainee landscape architect student or recent graduate or landscape designer graduate or with some training who can make sketches or layouts of gardens and learn to make inspirational and finished concepts or designs. ", "\n  Will consider an experienced landscape architect and the future possibility of Jr. partnerships. ", "\n", "\nAlso hiring all around assistant with energy and experience in team and meeting support, customer relations, writing emails, invoicing, organizing clients and keeping payroll etc. ", "\n", "\nDrivers license is a plus ", "\n", "\n   TO APPLY: GO TO WEBSITE \"Contact Us\" page and leave:", "\n", "\nName ", "\nPhone", "\nemail", "\nGeneral experience", "\nwhen you can start", "\nDrivers license", "\nReference 1 personal 1 business", "\ncommon sense information and brief cover letter. ", "\n", "\nThanks!", "\n    "]},
{"date": "2019-09-22 11:28", "link": "https://newyork.craigslist.org/que/egr/d/wyandanch-cnc-operator-architectural/6984074358.html", "text": "CNC Operator Architectural Millwork", "compensation": "Full-time position with benefits and excellent growth opportunity. Overtime is available. Pay Rate is commensurate with your experience and potential.", "type": "full-time", "address": ["\n        ", "\n*CAREER OPPORTUNITY - There's more to a person than their skill set and achievements listed on a resume.", "\n", "\nWe are looking for a specific type of Team Member to be a part of our Company. Do you love being part of something bigger than just a job? Do you want to know the things you do have an impact? Are you the type of person who likes to learn more about every facet of a process or project? Do you love diving in to a problem and finding the solution no matter how elusive it is? Do you want to see the things you fabricate become part of a historically significant project? Do you love leading and helping your team win?", "\n", "\nIf you are excited by these questions, you have a strong work ethic and mechanical aptitude; we may be perfect for each other...", "\n", "\nCareer Path: CNC Programmer / Operator- Working in the CNC Shop you will hone your skills in MasterCAM, 3d Modeling, Working with 3D Laser Scanners, Mold Design, CNC Operation & Maintenance as well as get to know the workflow and products manufactured. You can move from here to a Shift Supervisor position.", "\n", "\nOpen Position: CNC Programmer / Operator: An ideal candidate has strong MasterCAM, 2D and 3D experience, CNC milling positives and negatives in wood and foam. As well as experience maintaining 3 and 5 axis CNC machines.", "\n", "\nSummary of Responsibilities:", "\nResponsible for Safety, First Time Quality, and Machine Efficiency", "\nDaily upkeep of our scheduled processes and performance tracking of Key Performance Indicators (KPI)", "\nResponsibility includes being assigned to other functions as required.", "\n", "\nKey Specific Requirements:", "\nEducation / experience:", "\nMinimum of a BA in Mechanical Engineering", "\nMinimum of 5 years experience in requisite skills.", "\nSoftware Skills:", "\nMasterCAM: Expert Level", "\nSolidWorks or AutoCAD Inventor: Expert Level", "\nRhino: Intermediate Level preferred ( Basic Level is acceptable)", "\nPointcloud: Basic Level is acceptable", "\nMS Office and Google Suite: Intermediate Level", "\nInterpersonal and Communication Skills:", "\nWritten and Verbal Communication skills must be exemplary,", "\nAbility to maintain an upbeat and positive attitude at all times,", "\nAbility to work as part of a team as well as in self-directed, fast-paced professional environment,", "\nMeasurements of Performance:", "\nSafety", "\nObjective measurements (Key Performance Indicators)", "\nFirst Object: Time / Quality", "\nLabor Efficiency", "\nMachine Efficiency", "\n", "\nBenefits:", "\nPersonalized growth track,", "\nMedical benefits package", "\nPTO includes: holidays, vacation and personal time", "\n", "\n", "\n* Corinthian Cast Stone embraces diversity and equal opportunity in a serious way. We are committed to building a team that represents a variety of backgrounds, perspectives, and skills. The more inclusive we are, the better our work will be. All aspects of employment including the decision to hire, promote, discipline, or discharge, will be based on merit, competence, performance, and business needs.    "]},
{"date": "2019-09-22 21:21", "link": "https://newyork.craigslist.org/que/egr/d/flushing-seeking-autocad-draft-persons/6984453708.html", "text": "Seeking AutoCad Draft persons", "compensation": "Compensation based upon experience", "type": "employee's choice", "address": ["\n        ", "\nLicensed Architect Firm in Flushing seeks Architect Office Assistants and Architectural AutoCad draft persons. Architectural background and experience in NYC Zoning and Building Code is a plus. Need strong computer skills. ", "\nThe company is located in flushing, Queens. ", "\n", "\nPlease send resume and salary request for interview.    "]},
{"date": "2019-09-23 07:35", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-architect-drafter/6984576039.html", "text": "Architect Drafter", "compensation": "Based on Qualifications", "type": "full-time", "address": ["\n        ", "\nBusy Design and Consulting firm is looking for a talented individual to join our team.", "\n", "\nOur work includes renovations and ground ups of small, medium and large scale single and multi-family residential, commercial, community facility and mixed-use projects. ", "\n", "\nResponsibilities will include production of design development and construction documents, Candidates must be self-motivated, reliable and able to manage all aspects of a project.", "\n", "\nCandidate Qualifications:", "\nBe familiar with NYC codes and zoning.", "\nKnowledge of construction materials, details and methods.", "\nProficiency in Revit and AutoCAD.", "\n", "\nWe are looking for highly motivated individuals who are willing to take on responsibility and grow with our team. Interested applicants must be quick to learn and adapt new drawing methods, related zoning & code rules, DOB and related agency requirements. detail-oriented, collaborative, and eager to take on challenges", "\n", "\nQualified individuals should submit a *brief description of your qualifications, *work samples, *starting salary requirements, in pdf or word format    "]},
{"date": "2019-09-23 09:47", "link": "https://newyork.craigslist.org/brx/egr/d/bronx-drafter-salesperson/6984642369.html", "text": "Drafter/ Salesperson", "compensation": "$25.00 an hour", "type": "full-time", "address": ["\n        ", "\nArchitectural Sheet Metal Shop looking for a draftsman to join our team. ", "\n", "\nRequirements ", "\n", "\n- Autocad experience a must", "\n- Prior related experience in sheet metal drafting required", "\n- Prior experience with customer relations ", "\n- Knowledge of quickbooks a plus ", "\n- A valid drivers license a plus", "\n", "\nTasks includes: ", "\n", "\n- Assisting with day to day sales", "\n- Takeoff/ estimating ", "\n- Evaluating architectural drawing and converting them into shop drawings", "\n- Visiting job-site to get field measurements. ", "\n- Meeting with clients", "\n- Programing files for laser cutting machine (will train) ", "\n", "\n", "\n", "\n    "]},
{"date": "2019-09-23 10:03", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-draft-person-junior-architect/6984654831.html", "text": "Draft person / Junior Architect", "compensation": "compensation dependable on experience", "type": "full-time", "address": ["\n        ", "\nSmall architectural firm is looking for Draf person/Junior Architect -", "\n", "\nWe need motivated person with strong computer skills, ", "\nperson should have Autocad experience.", "\n", "\nThe responsibilities will include preparation of design development and construction documents. Contact with clients and vendors. ", "\n", "\nPlease send resume and work sample. ", "\n", "\nWe are located in Greenpoint Brooklyn,    "]},
{"date": "2019-09-23 10:38", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-intermediate-sr-architect-5/6984683913.html", "text": "Intermediate - Sr. Architect / 5 Star Hospitality", "compensation": "Will be flexible for top talent.", "type": "full-time", "address": ["\n        ", "\nAD100, Architecture & Interiors firm seeks Intermediate and Sr. Architect to join a project team producing elite level hotel and residential interiors. A true opportunity to step \"up\" in level of design intent, and acquire experience and knowledge of how to deliver some of the most incredibly custom interior environments being produced today. ", "\n", "\nSeeking individuals with 3 - 5 and 5+ years experience, BArch, strong AutoCAD, and demonstrated ability to execute complex interior environments at a high DD standard or CD level. Compensation is negotiable. ", "\n", "\nLong term professional gains from this type of working experience has proven invaluable to past employees. We look forward to your resume and work samples, and will respond immediately with feedback.    "]},
{"date": "2019-09-23 10:55", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-interior-design-director/6984699179.html", "text": "Interior Design Director", "compensation": "Salary, Health Benefits, Annual Bonus", "type": "full-time", "address": ["\n        ", "\nWe are a Design Build Firm looking for an \"Experienced Interior Design Director\" that is energetic and posses an extremely positive mental attitude.  You will oversee a team of young talented designers that are truly passionate about design and are extremely motivated to expand their knowledge and grow as design professionals. You will be involved in the design projects from start to finish and in charge of managing the design project schedules to ensure your design team is meeting the client's design objective, budget, and deadline. ", "\n", "\nYou must possess artistic and creative skills to visualize design projects by employing your analytical skills to choose and supervise a design team that will create projects based on specific client needs. The Design director works in the office within a collaborative environment and reports directly to the CEO. You will be leading a team of creative designers at different skill levels. Your role as the design director is to bring out the best in your team and to mold your younger designers to become better and more knowledgeable at their craft. You will also be attending offsite and onsite client meetings around the Manhattan.", "\n", "\n", "\nWhat you will be doing", "\n", "\nDevelops and implements guidelines, processes and standards for the design department", "\nSet individual goals to each team member and provides feedback on the staff’s development", "\nCreate a growth strategy for the Interior Designers: standardizing salaries, increments, and bonus", "\nEnsure Designs are buildable given the existing site conditions", "\nEnsure Project Milestones are hit on time", "\nEnsure Client Budgets are met", "\nSetting client expectations and meeting them", "\nCreate and Implement New Systems, Standards, & Policies", "\nLead through a positive mental attitude", "\nProvide Solutions to day to day situations", "\n", "\n", "\nRequirements", "\n", "\n10+ Years in New York City Interior Design & Construction Field Experience", "\n3+ Years of Design Management Experience", "\nTrade Relationships", "\n", "\n", "\n", "\n", "\nInterior Design Director, Interior Design Manager, Interior Designer, Senior Designer    "]},
{"date": "2019-09-23 17:48", "link": "https://newyork.craigslist.org/que/egr/d/project-architects/6985092545.html", "text": "Project Architect(s)", "compensation": "Commensurate with Experience", "type": "full-time", "address": ["\n        ", "\nMssa, a Small Successful 9-Person Architectural studio based in Queens is seeking Project Architect(s). Our projects include single-family residential, multifamily, and mixed-use hospitality projects. The studio offers an opportunity to be involved in all phases of the urban built environment from Design Development, Construction Documents, Consultant Coordination and City Approvals to Project Close up. The candidate shall be willing to work on a whole range of projects from small extensions to multifamily and hospitality.", "\n", "\nRequirements", "\n• BS or 5-year Professional degree in Architecture", "\n• Minimum 3 years US experience in an architecture office", "\n• Proven ability to produce Construction Documents", "\n• Working knowledge of NYC code and zoning regulations", "\n• Familiarity with DOB procedures a plus", "\n• Site visits and requisition review", "\n• Check submittals and respond to requests for information", "\n• Fluent with Autocad Architecture 2017/18", "\n• Revit 2017 Experience a plus", "\n• Strong work ethic ", "\n• Fluent English ", "\n", "\nPlease submit your resume including work samples with a particular emphasis on construction documents.", "\n    "]},
{"date": "2019-09-23 21:50", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-construction-project-manager/6985238698.html", "text": "Construction Project Manager", "compensation": "TBD", "type": "full-time", "address": ["\n        ", "\nPrepare complete and detailed scopes of work for construction trades.", "\n", "\nPerform quantity take-offs with accuracy and completeness.", "\nSolicit budgets and bids from subcontractors and suppliers in a timely fashion", "\nResolves cost discrepancies by collecting and analyzing information.", "\nPrepares special reports by collecting, analyzing, and summarizing information and trends.", "\nMonitor project costs and schedule", "\nMonitor site supers and attend meetings", "\n", "\nAt least 4 years industry experience minimum", "\n", "\nPlease email resume with expected salary", "\n", "\nAlso looking for Estimators and Assistant Project managers/site supers    "]},
{"date": "2019-09-24 10:53", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-nyc-dob-architect/6985467171.html", "text": "NYC DOB_ Architect _ Architectural Services- filing set_ Freelancer", "compensation": "TBD", "type": "full-time", "address": ["\n        ", "\nArchitectural Services- filing set_ Architect_ Freelancer\\Independent Contractor", "\n", "\nWe are seeking an Architectural Associate/CAD drafter to create NYC DOB filing sets for commercial renovations, specifically Restaurant projects primarily in Manhattan.", "\n", "\nRESPONSIBILITIES:", "\n• Survey existing and as-built conditions on sites located throughout the NYC area", "\n• Create Architectural Drawings and Construction Documents (Alteration Type 1 and Type 2)", "\n• Zoning Analysis and Diagrams", "\n• Drawing existing and proposed sections and elevations", "\n• Update drawing sets based on NYC Plan Examiner Objections", "\n• Prepare DOB filing set packages and coordinate with Expediter to file with Department of Buildings.", "\n", "\nPosition is an independent contractor/ freelancer    "]},
{"date": "2019-09-24 10:53", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-dob-filing-representative/6985467795.html", "text": "DOB Filing Representative- Freelance", "compensation": "TBD", "type": "contract", "address": ["\n        ", "\nJob Description", "\nFiling Representative needed to file DOB Architectural filing set and certificate of correction in Manhattan NY.", "\n", "\nMust have Class 1 or 2 Filing Representative License.", "\n", "\nRESPONSIBILITIES:", "\n", "\nDOB (Department of Buildings)", "\n", "\n1. Pre-filing and E-filing for job filings (ALT 1, 2, 3, Demo, PA)", "\n2. DOB Now Build", "\n3. DOB Now Safety", "\n4. DOB Now Inspections:", "\nSchedule Construction, Plumbing, Electrical inspections", "\nDelegate pertinent parties", "\nDownload Pass - Final Reports and submit for sign-off", "\nUpload corrections for certifiable objections", "\n5. DOB Permits PW 1, PW 2, PW 3, PW4, After hour variances", "\n6. Site Safety Plans", "\n7. Records Room research: microfilm, block and lot, folder", "\n8. Post Approval Amendments", "\n9. Violations (AEU2, AEU20, Dismissals, Waivers)", "\n10. Stop Work Orders, Partial Stop Work Orders", "\n11. Obtain New DOB Tracking Number for Contractors and insurance updates", "\n12. Required Items submission", "\n13. Letter of Completions", "\n14. Temporary and Final Certificates of Occupancy", "\n15. Schedule and attend Plan Examiner appointments to obtain approvals", "\n16. Attend Chief Plan's examiners meetings with Architects, Engineers, Developers, Property Managers", "\n17. Attend meetings with Deputy Borough Commissioners", "\nDOT (Department of Transportation)", "\n", "\n1. DOT Permits: Sidewalk, Fire Hydrant, Curb Cut", "\nECB (Environmental Control Board)", "\n1. Attend ECB hearings", "\n2. Process penalty payments", "\n", "\nTOPO (Topographical Bureau)", "\n", "\n1. Street Address Verification", "\nDOF (Department of Finance)", "\n", "\n1. Tax Maps", "\n", "\nFDNY (Fire Department of the city of New York)", "\n", "\n1. Submit applications", "\n2. Obtain Building Profiles, Notices of Violation and Violation Orders", "\n3. Attend appointments", "\n", "\n", "\n", "\n    "]},
{"date": "2019-09-24 17:46", "link": "https://newyork.craigslist.org/brk/egr/d/nys-licensed-architect-or-pe/6985840258.html", "text": "NYS Licensed Architect or PE", "compensation": "TBD", "type": "contract", "address": ["\n        ", "\nArchitectural Design and Consulting firm is looking for a NYS Licensed professional to review and consult on our projects. A great opportunity to become part of a knowledgeable and expending team experienced in residential and commercial projects.", "\n", "\nGreat opportunity to joint venture, we turn around over 100 project yearly and expending  ", "\n", "\n", "\n    "]},
{"date": "2019-09-24 11:06", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-corporate-interior-designer-in/6985479126.html", "text": "Corporate Interior Designer - (In-house)", "compensation": "competitive salary based on experience", "type": "full-time", "address": ["\n        ", "\nHigh-profile financial Services firm looking for an interior designer to join their in-house design team. This person will be responsible for space planning, ff&e selection as well as working and directing outside architecture & design consultants. This is a great opportunity for someone looking to move into an in-house role for a reputable, funded company. ", "\n", "\nThe right person for this will have: ", "\n", "\nBachelor of Interior Design or Equivalent", "\n4 years of post-grad experience", "\nAutoCAD, Adobe Suite ", "\nat least 3 years of experience in high-end, corporate interior design", "\n    "]},
{"date": "2019-09-25 06:33", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-junior-architect/6986083394.html", "text": "Junior Architect", "compensation": "competitive compensation and benefits offered", "type": "full-time", "address": ["\n        ", "\nSmall Upper East Side firm specialized in luxury residential projects is looking for a Junior architect with at least two years of experience or master's degree. ", "\nCandidates should be able to work independently and have strong computer skills. Proficiency working with Autodesk and Adobe software is a most. Grass hopper, 3d Printing and 3d modeling applications are a plus.", "\nCandidates will need to have strong verbal and written communication skills.    "]},
{"date": "2019-09-25 08:38", "link": "https://newyork.craigslist.org/brk/egr/d/long-island-city-assistant-construction/6986116768.html", "text": "Assistant Construction Project Manager", "compensation": "Competitive", "type": "full-time", "address": ["\n        ", "\nAssist PM directly onsite - at least 1 year of construction experience is needed.", "\n", "\nWe are looking for an individual who is eager to learn, motivated and a go-getter. Please reply with your resume and let us know why you would be a good fit for this job! ", "\n", "\nResponsibilities and Duties:", "\n", "\nTrack and document and alert the PM to changes to project scope", "\nGenerate and track RFI's, submittals, updated drawings, sketches etc.", "\nUpdate PM and Site Super on scheduling, deliveries, lead times, dependencies and all specification and plan changes as they occur", "\nSchedule deliveries with suppliers via company office", "\nWeekly Timeline update for PM", "\nImplement site safety program along with PM", "\nKeep detailed daily logs of work performed along with delivery log", "\nLabor management and time tracking of crews, daily sign in for crew", "\nCreate, coordinate and manage photo log of projects week to week", "\n", "\nQualifications and Skills:", "\n", "\nClear communication", "\nConcrete and masonry experience desired", "\nHighly organized", "\nProblem-solving", "\nOn-time", "\nExcellent Microsoft Excel, Word, Adobe Acrobat and Outlook", "\nExcels in team environment", "\nAble to understand construction drawings", "\n", "\nJob Type: Full-time    "]},
{"date": "2019-09-25 10:10", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-project-manager-construction/6986174629.html", "text": "Project Manager - Construction", "compensation": "Compensation commensurate with verifiable experience", "type": "full-time", "address": ["\n        ", "\nAIK Renovations is a fast growing commercial and residential construction company in the metropolitan New York area. We are actively seeking an experienced Project Manager for work on our commercial and residential construction projects in and around Manhattan.", "\n", "\nThe ultimate responsibility of the construction Project Manager is the complete and timely planning, coordination, execution and delivery of our projects along with the respective pre-construction, construction and post-construction requirements customary in the construction industry.", "\n", "\nEducational and Professional Qualifications:", "\n", "\n-At least five years of relevant experience as a Project Manager", "\n", "\n-Must have a proven record of managing complex construction projects ", "\n", "\n-Must have strong client relations skills and a collaborative disposition", "\n", "\n-Demonstrate proficiency in reading commercial and residential construction plans and specifications", "\n", "\nOther Requirements Include:", "\n", "\n-Knowledge of the construction industry (both residential and commercial), with a focus on interior renovation work.", "\n", "\n-Must be able to multitask and effectively manage multiple projects simultaneously.", "\n", "\n-Excellent written and verbal communication skills and meticulous attention to detail are requirements.", "\n", "\n-Must be able to work independently and as part of a dynamic team.", "\n", "\n-Ability to create project schedules/timelines.", "\n", "\nAbout AIK Renovations:", "\nAIK is a leading commercial and residential contractor based in New York City. Incorporating the highest quality materials and state-of-the-art construction techniques in conjunction with superior project coordination and construction supervision, AIK strives to surpass our clients’ expectations while delivering unique projects on time and within budget.    "]},
{"date": "2019-09-25 10:27", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-short-term-and-temp-to-hire/6986187730.html", "text": "Short term and temp-to-hire Project Architect", "compensation": "$35-50 per hour", "type": "full-time", "address": ["\n        ", "\nAre you seeking short term in office work or temp-to-hire? (not remote/work from home)", "\nBachelor or Master of Architecture - Project Architect", "\nAutoCAD or Revit skills for development of design and construction documents.", "\nClient Contact", "\nPossible design, client contact or project management responsibilities. ", "\n", "\nProject include: Residential + Commercial", "\n", "\nHourly rate - $35-50 as 1099/Independent Contractor", "\n", "\nSubstantial projects with small firm (approximately 20 people)", "\n", "\nImmediate interview and start. ", "\nAll candidates must be immediately available and currently eligible and authorized to work in the U.S. for any employer.", "\nPlease submit resume plus work samples under 25 mb as PDF attachments for immediate confidential review.", "\n", "\nThank you!", "\n", "\n    "]},
{"date": "2019-09-25 11:36", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-architectural-job-captain/6986247430.html", "text": "Architectural Job Captain", "compensation": "salary commensurate with experience", "type": "full-time", "address": ["\n        ", "\nSBLM New York office looks for a highly motivated Job Captain who is a team player with excellent REVIT skills. Ideal candidate will be a well-organized, detail-oriented individual who is accustomed to working on and leading the production of multiple projects. ", "\n", "\nResponsibilities include, but not limited to: ", "\nCoordinate and develop construction documents", "\nTake on technically challenging issues with Project Manager", "\nPerform code and zoning analyses", "\nReview and redline drawings", "\nOversee drafters, as required by the project", "\nProduce deliverables without requiring constant supervision", "\nCoordinate meetings with consultants", "\nOrganize and lead site visits and surveys", "\nConduct material research and meet with vendor as necessary, to understand", "\nmaterials and products", "\nTake initiative to complete work", "\n", "\nRequirements:", "\nBachelor’s Degree in Architecture", "\n3+ years’ experience in an Architect’s office working on Commercial/Retail projects", "\nMust be proficient in Revit and other applicable industry software is a must", "\nGeneral understanding of codes and zoning", "\nGeneral knowledge of building details and construction process", "\nPositive attitude and driven to succeed", "\n", "\nCompensation and Benefits:", "\n•\tWe offer a competitive salary and benefits package commensurate with the level of experience and a creative and innovative work environment.", "\n•\tOur benefit package includes Medical/Dental/Vision insurance, 401k Retirement Plan, Flexible Spending Plans, Paid Time Off, Holidays and much more.", "\n•\tOur company culture features professional learning and growth opportunities, rewarding project types to participate in and free ongoing professional educational programs.", "\n", "\nInterested candidates should forward their cover letter and resume ", "\nPlease include Job Captain in the subject. No phone calls, please.", "\n    "]},
{"date": "2019-09-25 12:12", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-architects/6986281422.html", "text": "Architects", "compensation": "commensurate with position and experience", "type": "full-time", "address": ["\n        ", "\nDouglas C. Wright Architects seeks highly motivated Architects with 1+ years experience for full time positions.  The job is listed on Archinect as well.  You can apply through either site: ", " ", "\n", "\nFor the positions offered, we would look for the following:", "\n", "\nEntry level/ 1 year experience acceptable", "\nProject Architect for those with more experience, showing familiarity with all aspects of  project management (budgets, schedules, communications with clients and consultants, document management from design through construction documents, document production and Construction Administration )", "\nExperience with high-end residential work (either apartments, townhouses, or single family homes)", "\nExperience with country clubs a plus, but not required.", "\nExperience managing teams of 1 or more architects a plus ", "\nLeadership and collaboration skills", "\nGood communication skills with other architects, contractors, consultants and the experience of coordinating these teams", "\nMulti-tasking/time management skills: the ability to work on several projects at the same time in either a management or production role.", "\nGraduate level degree from a school with courses in the history of architecture and traditional design methods.", "\nThe position requires fluency in AutoCAD.  High proficiency or the ability to manage designers in Adobe Creative Suite programs, Photoshop, In Design, Microsoft Word and PowerPoint.  Knowlege of Google SketchUp and Revit would be highly regarded. ", "\n", "\nRefined skills in the following are preferred, though not required:", "\n", "\nFreehand drawing and design ability, hand drafting", "\nRendering skills in watercolor, marker, pencil or other media", "\nWe are a young firm with much room for advancement in these positions. These are offered as career track positions. Excellent performance would be recognized and rewarded with greater responsibilities and compensation. Salaries would be commensurate with experience.", "\n", "\n", "\nAll interested applicants should include a cover letter stating your interest in the position, your resume and experience, including your role and responsibilities on projects (design, drafting, redlines, coordination, and project types in which you have experience ) and salary requirements.", "\n", "\nPlease also include a sample of your graphic skills. Submissions of graphic work through the Archinect app center should be under 2Mb. Larger attachments will not be accepted. An applicant must be authorized to work in the US.", "\n", "\nPlease apply for this position through Archinect.  Please do not email the office directly, as these inquiries will not be read. ", "\n", "\nDouglas C. Wright Architects is a full service firm working on a wide range of project types:", "\n", "\nHigh-end residential – both houses and apartments", "\nLarge scale residential estates", "\nMaster planning for clubs, resorts, and other institutions", "\nRestorations and renovations", "\nCountry clubs", "\nInstitutional buildings", "\nCommercial projects", "\nPlease see our website: www.dcwarchitects.com for an overview of the firm’s projects, design philosophy and work approach, and biography, and to consider if you would be interested in applying for the positions.", "\n", "\nOur health insurance plan can be joined after three months employment with the firm.  After six months of employment, DCWA will pay for half of the cost of health insurance for the individual employee.  The remainder of premiums for the individual or family are paid by the employee pre-tax through DCW Architects at our group rate.  You would be an \"at will\" employee. ", "\n", "\nPosition could start immediately.    "]},
{"date": "2019-09-25 16:11", "link": "https://newyork.craigslist.org/wch/egr/d/mamaroneck-junior-architect/6986499908.html", "text": "Junior Architect", "compensation": "Commensurate with Experience", "type": "full-time", "address": ["\n        ", "\nKeller/Eaton Architects, PC is an award winning, high-end residential architectural and interior design firm in Mamaroneck, NY. We are seeking a talented and motivated individual to join our team to help create amazing spaces. Position is full time, with competitive salary and benefits. ", "\n", "\nQualifications: ", "\n-Bachelor of Architecture from an accredited institution.", "\n-Ability to work independently and collaboratively in a team environment.", "\n-Willingness to multi-task, work on many different projects and meet project deadlines.", "\n-Clear and concise written and verbal communication skills.", "\n-Efficient drafting skills with particular attention to detail and line weight.", "\n-Experience in residential architecture a plus.", "\n-Positive attitude and driven to learn/succeed.", "\n-Must have a personality. Zombies need not apply.", "\n-Proficiency in Autocad, Photoshop, 3-D modeling a plus.", "\n", "\nSalary commensurate with experience. Must be authorized to work in the United States. For examples of our work or to learn more about the firm, please visit www.rkdea.com.", "\n", "\nPlease email your resume, work samples and salary requirements. No phone calls please.", "\n    "]},
{"date": "2019-09-26 09:49", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-nys-registered-architect/6986880471.html", "text": "NYS Registered Architect", "compensation": "to be discussed", "type": "contract", "address": ["\n        ", "\nLooking for NYS Registered Architect to join our team to review and consult design documents for DOB And construction as design applicant, Ideally you have experience in residential architecture in NYC, some knowledge of NYC DOB and LPC, please send resume along with your licences #    "]},
{"date": "2019-09-26 10:16", "link": "https://newyork.craigslist.org/que/egr/d/long-island-city-drafting-estimating/6986898902.html", "text": "Drafting/Estimating Internship", "compensation": "Unpaid Internship", "type": "part-time", "address": ["\n        ", "\nOur company is offering an internship for recent graduates/college students with Architectural, Construction Management or Engineering background and interested in real world experience in the Manufacturing Industry.", "\n", "\nWe are a top fabricator in the Northeast for custom metal facade and roofing components. Our Design & Estimating Department are looking for an individual who is interested in the business, design and developmental aspects of architecture. ", "\n", "\nThe internship program provides a unique opportunity to gain experience in:", "\n-\tCost Estimation", "\n-\tSpecs & CD", "\n-\tMarketing Strategy and PR", "\n-\tFabrication", "\n-\tInstallation and Field Relationship", "\n", "\nWe are looking for interns who are:", "\n-\tSelf-motivated and able to receive/ use constructive criticism", "\n-\tCommunicative; willing to ask questions, share their ideas ", "\n-\tTeam Players willing to work with others", "\n-\tPunctual, reliable and responsible", "\n-\tInterested in architectural methods/materials in Roofing/Facade", "\n", "\n", "\nCandidates must have knowledge of Microsoft Office, AutoCad, experience in Rhino is a plus! ", "\nInterns must be present 20 hrs/week for 3 Months. Full time positions are available for best candidates.", "\n", "\nThis is not a paid internship however; a lunch and 75% travel stipend will be provided.", "\n", "\nPlease send a resume and work samples to Craigslist email listed.    "]},
{"date": "2019-09-26 11:08", "link": "https://newyork.craigslist.org/lgi/egr/d/valley-stream-estimator/6986939894.html", "text": "Estimator", "compensation": "will discuss based upon experience", "type": "full-time", "address": ["\n        ", "\nWe are a Nassau based commercial union shop. We specialize in Architectural Metal & Glass. We are looking for a candidate to become part of our company.", "\n", "\n Responsibilities include:", "\n -Follow up with vendors for price quotes for jobs", "\n - Get submittals for jobs & shop drawings", "\n - Preliminary review of bid documents for each project", "\n - Communication with general contractors regarding RFIs & questions.", "\n - General understanding of supplier & specialty item pricing", "\n - Must be proficient in Microsoft Word & Outlook", "\n - Organizational skills which allow you to manage work loads and meet deadlines ", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n", "\n    "]},
{"date": "2019-09-26 12:06", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-junior-architect-amazing/6986990522.html", "text": "Junior Architect | Amazing Temporary Opportunity", "compensation": "$30-$35 per hour", "type": "full-time", "address": ["\n        ", "\nDESIGNER! 2-3 MONTHS. (Monday-Friday in office, regular business hours)", "\n", "\nTitle:", "\nJunior Architect | Commercial & Retail Architecture Projects", "\n", "\nA small, successful midtown Manhattan design firm needs additional help in the office for between 2 and 3 months to work on site surveys and AutoCAD drafting for a variety of commercial and retail architecture projects.", "\n", "\nIf you have a professional degree in architecture from an accredited University, work experience using AutoCAD for design development and construction documents, please submit your detailed resume plus work samples for immediate review.", "\n", "\nWork begins immediately with a competitive hourly rate.", "\n", "\nPlease submit PDF attachments only. Thank you!    "]},
{"date": "2019-09-26 13:16", "link": "https://newyork.craigslist.org/fct/egr/d/stamford-earn-up-to-19-hr-deliver-with/6987056235.html", "text": "Earn up to $19/hr! Deliver with Grubhub - Apply now!", "compensation": "Per order fee + mileage + 100% tips", "type": "contract", "address": ["\n        ", "\n\n        ", "\n    "]},
{"date": "2019-09-26 13:34", "link": "https://newyork.craigslist.org/que/egr/d/woodside-earn-up-to-18-hr-deliver-with/6987073598.html", "text": "Earn up to $18/hr! Deliver with Grubhub - Apply now!", "compensation": "Per order fee + mileage + 100% tips", "type": "contract", "address": ["\n        ", "\n\n        ", "\n    "]},
{"date": "2019-09-26 13:51", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-plumbing-fire-protection/6987090347.html", "text": "Plumbing fire protection engineer", "compensation": "$75-85K annual", "type": "full-time", "address": ["\n        ", "\nP. A. Collins PE Consulting Engineers has a wide variety of projects and seeks CAD literate, experienced plumbing/fire protection engineer. Minimum 3-5 years experience in designing sprinkler, able to perform hydraulic calculations, water distribution, water heating, sanitary and storm drainage. Able to create DEP cross connection applications. Excellent spoken and written English skills, BSME, EIT, LEED AP, NICET are desirable, must be familiar with NYC Plumbing Codes, self-starter, team player, detail oriented a must.  ", "\nSome experience with mechanical systems design is required.", "\nBenefits include health insurance with dental and vision, 401k retirement plan with employer contribution, TASC Cafeteria 125 Flex plan for subsidized transportation, parking and dependent care, flextime entry exit if required, holidays and vacations.", "\n    "]},
{"date": "2019-09-26 15:19", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-fabrication-project-manager/6987167141.html", "text": "FABRICATION PROJECT MANAGER (millwork, construction)", "compensation": "commensurate with experience", "type": "full-time", "address": ["\n        ", "\nMillwork shop in Greenpoint, Brooklyn looking for a Project Manager to lead project communication and organization. ", "\n", "\nWe are a rapidly growing fabrication company working mainly in bar and restaurant build-outs.", "\n", "\n", "\nScope will include:", "\n", "\n- Managing communication with client/designer : fielding emails, attending site meetings, providing detailed accounts and acting as a competent and professional company representative", "\n", "\n- Overseeing project documents : receiving, organizing and tracking, disseminating accurate and up-to-date drawings to team", "\n", "\n- Subcontractor coordination : provide/review fabrication drawings, track fabrication and timely delivery", "\n", "\n- Maintaining project logs : Submittals, COs, etc.", "\n", "\n- Shop Drawing coordination : work closely with drafter to review and red line shop drawings, track corrections and revisions, maintain Shop Drawing set throughout the job: tracking and adding changes as they occur", "\n", "\n- Miscellaneous drafting : RFIs & SKs during Production & Installation phases, misc. CNC files for fabrication", "\n", "\n", "\nMust have previous experience in either Architectural or Construction Project Management", "\nMust be familiar with Architectural & Fabrication shop drawings and standards", "\nMust have CAD drafting experience", "\nMillwork shop experience a plus", "\nShop Spanish a plus", "\n", "\nSalary commensurate with experience", "\n    "]},
{"date": "2019-09-26 15:39", "link": "https://newyork.craigslist.org/que/egr/d/brooklyn-drafter/6987183966.html", "text": "Drafter", "compensation": "TBD", "type": "full-time", "address": ["\n        ", "\nConstruction company specializing in exterior restoration will hire a draftsman.    "]},
{"date": "2019-09-26 16:21", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-architect-designer/6987219425.html", "text": "Architect/Designer", "compensation": "Compensation commensurate with experience", "type": "full-time", "address": ["\n        ", "\nWe are an established and awarded small architectural firm located in Manhattan. Our projects cover public buildings and educational facilities. We are looking to hire talented individuals who have the potential and ambition for growth towards positions in office leadership.", "\nOur office organization enables staff members a hands-on experience. Working on multiple projects and different phases of work, including design, construction documents and job administration. Our transparent office environment provides exposure to all aspects of the practice.", "\nQualifications:", "\n•\tBe a US citizen or be permitted to work in the USA", "\n•\tProfessional degree in Architecture", "\n•\tSkill in Autocad and presentation software. Revit capability a plus.", "\n•\tUSA experience in design, detailing and construction administration.", "\n•\tVerbal and writing abilities.", "\nWork description:", "\n•\tParticipate in the design and production of multiple projects at all design and project administration phases.", "\n•\tAttend site meetings and prepare minutes. Observe and document progress and quality of construction work.", "\n•\tCommunicate with in-house staff, consultants and clients.", "\n•\tDemonstrate skill in the use of drafting and presentation software.", "\n", "\nWe offer competitive salaries, health coverage and profit sharing.", "\nInterested candidates should email a cover letter, resume, work samples and requested compensation in PDF format.", "\n    "]},
{"date": "2019-09-26 16:56", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-interior-design-intern/6987247483.html", "text": "Interior Design Intern", "compensation": "Paid - Rate TBD", "type": "part-time", "address": ["\n        ", "\nNYC Interior Design Firm is seeking a self-driven, proactive intern with a “can-do” attitude  - to begin during the Fall of 2019. This is a paid position. Intern responsibilities include (but are not limited to) office organization, administrative errands, and presentation editing (mostly in Adobe). The ideal candidate will use these responsibilities as a platform to explore how their skill set can best suit our company. Employment beyond the Internship period will be considered.", "\n ", "\nWe are a high-end, residential Interior Design firm with current projects in Aspen, East Hampton, New York City, and Europe.    "]},
{"date": "2019-09-27 10:06", "link": "https://newyork.craigslist.org/brk/egr/d/new-york-concrete-highrise-gc-looking/6987602997.html", "text": "Concrete highrise/GC looking for engineer/estimator", "compensation": "EXCELLENT PAY AND BENEFITS   PROFIT SHARING", "type": "full-time", "address": ["\n        ", "\nEngineer to review construction plans for New Construction.  Stamp for submission to city building departments in Connecticut and New York   Excellent pay and benefits with profit sharing.    "]},
{"date": "2019-09-27 13:31", "link": "https://newyork.craigslist.org/stn/egr/d/staten-island-earn-up-to-18-hr-deliver/6987790943.html", "text": "Earn up to $18/hr! Deliver with Grubhub - Apply now!", "compensation": "Per order fee + mileage + 100% tips", "type": "contract", "address": ["\n        ", "\n\n        ", "\n    "]},
{"date": "2019-09-27 13:52", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-assistant-project-manager/6987810469.html", "text": "Assistant Project Manager Position - DOB Experience Required", "compensation": "Salary, medical, retirement, vacation", "type": "full-time", "address": ["\n        ", "\nWe are a Construction Consulting / Expediting firm in Manhattan and are currently seeking a full-time Assistant Project Manager who has experience with NYC DOB. This is a wonderful opportunity for someone who is a punctual, reliable, team player with a good work ethic and who enjoys a rewarding and fast-paced work environment.", "\n", "\nAPM Responsibilities are:", "\n", "\n• Process DOB filing sign-offs", "\n• Prepare form work for and obtain initial DOB Work permits", "\n• Track projects, communicate permit expiration with clients and renew permits", "\n• Establish safety registrations and general superintendent registrations", "\n• Track and Renew contractor insurance", "\n• Assist PMs as needed for management of C.O. projects", "\n• Assist with DOB Now Filings", "\n", "\nKey requirements:", "\n", "\n• Proficient with DOB on-line systems (BIS, DOB Now and E-filing)", "\n• Understanding of DOB project filing techniques, including HUB filings in order to determine permit and signoff requirements", "\n• Ability to effectively work with clients", "\n• Ability to communicate problems with staff if they occur", "\n• Experience with the Microsoft Office Suite", "\n• Ability to handle multiple projects simultaneously", "\n• Coordinate and track the progress of the tasks with staff expediters.", "\n", "\nPreference will be given to candidates possessing Filing Representative registration. Candidate must possess strong interpersonal, communication and writing skills and must have keen problem solving skills. Ideally, we seek someone who has the desire and drive to become a long-term, trusted member of our team. Compensation is based upon experience and includes a full benefits package.", "\n", "\nTo be considered you must provide the following:", "\n", "\n1.) a cover letter , 2.) your resume, 3.) your salary expectation or history.", "\n", "\nOur office is conveniently located near Penn Station and company provides paid time off, retirement plan, and major medical insurance.", "\n", "\nWe look forward to hearing from you.", "\n", "\nKey words: expediter, expeditor, DOB, D.O.B., DOT, D.O.T., Department of Buildings, Department of Transportation, Construction, Architect, Engineer, Consultant, Construction Consultant, Code, Zoning    "]},
{"date": "2019-09-27 14:03", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-project-manager-position-dob/6987817300.html", "text": "Project Manager Position - DOB Experience Required", "compensation": "Salary, medical, retirement, vacation", "type": "full-time", "address": ["\n        ", "\nWe are a Construction Consulting / Expediting firm in Manhattan and are currently seeking a full-time Project Manager who has experience with NYC DOB. This is a wonderful opportunity for someone who is a punctual, reliable, team player with a good work ethic and who enjoys a rewarding and fast-paced work environment.", "\n", "\nPM Responsibilities are:", "\n", "\n• Must be a Class 2 filing representative.", "\n• Review Plans for completeness.", "\n• Perform limited code/zoning consultation.", "\n• Develop filing strategies for all types of projects.", "\n• Prepare filing form work.", "\n• Coordinate C.O. signoffs; attend field meetings, mock inspections and construction inspections.", "\n• Meet with DOB Staff when needed for large scale projects.", "\n• Manage Assistant Project Managers and Field Staff to be sure projects are on track.", "\n", "\nAlso be able to:", "\n", "\n• Process DOB filing sign-offs", "\n• Prepare form work for and obtain initial DOB Work permits", "\n• Communicate permit expiration with clients and renew permits", "\n• Establish safety registrations and general superintendent registrations", "\n• Track and Renew contractor insurance", "\n", "\n", "\n", "\nKey requirements:", "\n", "\n• Proficient with DOB on-line systems (BIS, DOB Now and E-filing)", "\n• Understanding of DOB project filing techniques, including HUB filings in order to determine permit and signoff requirements", "\n• Ability to effectively work with clients", "\n• Ability to communicate problems with staff if they occur", "\n• Experience with the Microsoft Office Suite", "\n• Ability to handle multiple projects simultaneously", "\n• Coordinate and track the progress of the tasks with staff expediters.", "\n", "\nCandidate must possess strong interpersonal, communication and writing skills and must have keen problem solving skills. Ideally, we seek someone who has the desire and drive to become a long-term, trusted member of our team. Compensation is based upon experience and includes a full benefits package.", "\n", "\nTo be considered you must provide the following:", "\n", "\n1.) a cover letter , 2.) your resume, 3.) your salary expectation or history.", "\n", "\nOur office is conveniently located near Penn Station and company provides paid time off, retirement plan, and major medical insurance.", "\n", "\nWe look forward to hearing from you.", "\n", "\nKey words: expediter, expeditor, DOB, D.O.B., DOT, D.O.T., Department of Buildings, Department of Transportation, Construction, Architect, Engineer, Consultant, Construction Consultant, Code, Zoning    "]},
{"date": "2019-09-27 16:35", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-junior-interior-designer/6987953203.html", "text": "Junior Interior Designer / Decorator", "compensation": "based on experience", "type": "full-time", "address": ["\n        ", "\nWest Chin Architects & Interior Designers, a modern, high-end residential and hospitality interior design firm seeks full-time Junior Interior Designer. WCA encourages creativity in a dynamic, casual environment, and presents a great opportunity for the right candidate to develop their skills. The scope of our company includes a modern, high-end interior design and architectural studio, (2) home furnishing showrooms, and a furniture/product line.  ", "\n", "\nRequirements: ", "\n", "\n*2-4 years’ experience. ", "\n*Proficient in AutoCAD, Photoshop, InDesign & Excel.", "\n*Knowledge of Modern Furniture Resources. ", "\n*Strong organizational skills; ability to plan, prioritize and multi-task. ", "\n*Keen listening and note taking skills.", "\n*Excellent verbal and written communication skills.  Must be very fluent in the English language.", "\n*Attention to detail", "\n*Sound quantitative skills. ", "\n*Ability to thrive in a fast-paced environment and work both independently and closely with others. ", "\n*Technologically adept ", "\n", "\nResponsibilities: ", "\n", "\n*Working with Principal and Design Team on all related projects. ", "\n*FF&E ", "\n*Space Planning ", "\n*Documenting projects from design to installation. ", "\n*Site visits and documentation. ", "\n*Millwork design and detailing. ", "\n*Drawing sets, plans, elevations, schedules, etc.", "\n*Scheduling/overseeing installations.", "\n*Vendor correspondence, order management", "\n", "\nTo apply:", "\nPlease forward your details, resume, a link to your portfolio, or a sample of work at a maximum of 3MB. Please include requested salary.  No phone calls, please.", "\n    "]},
{"date": "2019-09-28 11:13", "link": "https://newyork.craigslist.org/fct/egr/d/stamford-earn-up-to-19-hr-deliver-with/6988366259.html", "text": "Earn up to $19/hr! Deliver with Grubhub - Apply now!", "compensation": "Per order fee + mileage + 100% tips", "type": "contract", "address": ["\n        ", "\n\n        ", "\n    "]},
{"date": "2019-09-29 13:10", "link": "https://newyork.craigslist.org/fct/egr/d/stamford-earn-up-to-19-hr-deliver-with/6989051407.html", "text": "Earn up to $19/hr! Deliver with Grubhub - Apply now!", "compensation": "Per order fee + mileage + 100% tips", "type": "contract", "address": ["\n        ", "\n\n        ", "\n    "]},
{"date": "2019-09-29 14:31", "link": "https://newyork.craigslist.org/que/egr/d/flushing-kitchen-designer-salesperson/6989108284.html", "text": "Kitchen Designer & Salesperson -- experienced", "compensation": "salary negotiable", "type": "full-time", "address": ["\n        ", "\n Experienced kitchen cabinet designer/salesperson wanted for a full time position, including Saturdays, in Flushing, Queens tile/kitchen cabinet store. Must be proficient in ProKitchen and 20/20. Must have own car for travel to clients' homes for on-site design consultations and final measurements. Parking in store lot provided. Salary negotiable.    "]},
{"date": "2019-09-29 14:42", "link": "https://newyork.craigslist.org/wch/egr/d/scarsdale-mold-inspector-part-time/6989115709.html", "text": "Mold Inspector Part-Time", "compensation": "$25 to $30/hour, Part-time (10 to 20 hours/week), 1099", "type": "contract", "address": ["\n        ", "\nAn environmental consulting company in Westchester is looking for a mold/asbestos/lead inspector as a part-time. ", "\n", "\nJob responsibilities include but are not limited to:", "\n", "\n•\tPerform asbestos, lead, indoor air quality investigations and risk assessments.", "\n•\tACM, lead based paint inspections, IAQ and mold inspections.", "\n", "\nDesired qualifications:", "\n", "\n•\tNYS DOL Asbestos Air Sampling Technician, Inspector", "\n•\tUSEPA Lead Risk Assessor / Inspector", "\n•\tNYS DOL Mold Assessor", "\n•\tHave your own transportation", "\n", "\nConditions:", "\n", "\n•\tPart-time (10 to 20 hours/week)", "\n•\tRate $25/hour to $30/hour depending on qualification ", "\n•\tPayment – twice a month through 1099 ", "\n•\tUse your own transportation", "\n•\tArea: Westchester, NY (90%) and surrounding areas (10%)", "\n", "\nPlease send me your resume for further consideration    "]},
{"date": "2019-09-30 10:13", "link": "https://newyork.craigslist.org/fct/egr/d/stamford-earn-up-to-19-hr-deliver-with/6989539503.html", "text": "Earn up to $19/hr! Deliver with Grubhub - Apply now!", "compensation": "Per order fee + mileage + 100% tips", "type": "contract", "address": ["\n        ", "\n\n        ", "\n    "]},
{"date": "2019-09-30 13:24", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-architectural-designer/6989712056.html", "text": "Architectural Designer", "compensation": "Determined upon experience (hourly)", "type": "full-time", "address": ["\n        ", "\nLooking for a freelance architectural designer to help create CD sets. Minimum of a 6 week period.    "]},
{"date": "2019-09-30 16:14", "link": "https://newyork.craigslist.org/wch/egr/d/mount-vernon-estimator/6989865747.html", "text": "ESTIMATOR", "compensation": "Based on Experience", "type": "full-time", "address": ["\n        ", "\n- Follow up with vendors for price quotes for jobs", "\n- Get submittals for jobs & shop drawings", "\n- Preliminary review of bid documents for each project ", "\n- Communication with general contractors regarding RFIs & questions", "\n- General understanding of supplier & item pricing", "\n- Must be proficient in Microsoft Word & Outlook", "\n- Organizational skill which allow you to manage work loads and meet deadlines", "\n- Excellent knowledge of wood technology and materials.  Ability to independently work on large commercial and residential projects.  High work ethic and self motivation. Very good people skill,", "\n- Outstanding attention to detail knowlege of Ms Project, On-Screen Take Off , SAGE Timberline Estimating Estimating Extended and AutoCad software    "]},
{"date": "2019-09-30 16:48", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-exterior-company-looking-for/6989894778.html", "text": "Exterior Company Looking for Project Manager w/ master riggers licens", "compensation": "To be discussed", "type": "full-time", "address": ["\n        ", "\nLooking for project manager with master riggers license.    "]},
{"date": "2019-09-30 16:58", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-project-architect/6989902260.html", "text": "Project Architect", "compensation": "To be discussed", "type": "full-time", "address": ["\n        ", "\nQuality Control- Senior Technical Project Architect", "\nStephen Wang & Associates Architect PLLC is an international architecture and interior design firm based in Manhattan.  The firm is currently seeking an experienced Senior Technical Project Architect who will oversee and implement the firms Quality Assurance, Quality Control program. This is a full-time position.", "\n", "\nThe successful candidate must have the following experience and qualifications:", "\n", "\n•\t  10 + years architectural related experience.", "\n•\tBachelor’s or master’s degree in Architecture required.", "\n•\tThis candidate will lead the review of design and construction documents in order to confirm quality control compliance with the contract deliverables", "\n•\tAdvanced knowledge and ability to conduct zoning and building code analysis and research is required.", "\n•\tDemonstrates advanced knowledge of building materials, detailing, construction techniques, building systems selection, related engineering principles, and construction cost structures", "\n•\tDirects and mentors’ Architectural staff in the preparation of design and technical documents", "\n•\tSubstantial experience in all aspects of Construction Administration, including site observation; managing contractor submittals and RFIs.", "\n•\tSupervises fellow team members and direct reports in the review of shop drawings and sample submittals", "\n•\tMust have solid process skills and good problem-solving abilities.", "\n•\tAbility to consistently meet deadlines, completing tasks as previously defined.", "\n•\tSupervisory and management skills required.", "\n•\tExperience using AutoCAD is required (Vectorworks proficiently is a plus)", "\n", "\n", "\n    "]},
{"date": "2019-10-01 09:35", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-junior-construction/6990248155.html", "text": "Junior Construction Project Manager", "compensation": "$65,000.00-$75,000.00 per depending on experience", "type": "full-time", "address": ["\n        ", "\nCommercial General Contractor located in midtown Manhattan has excellent opportunity for a Junior Project Manager. The ideal candidate must possess a minimum of 3-5 years experience in all phases of commercial construction including budgets, schedules, trade bids & supervision of field staff. ", "\nResponsibilities will include managing schedules, safety, change orders and client relations. The successful candidate will possess excellent interpersonal and communication skills .They must have the ability to resolve job related issues and insure the safe, on-budget and on-time completion of all assigned projects. Strong computer skills including Microsoft Excel, ability to create and maintain logs and scheduling software experience.Salary commensurate upon experience and qualifications.    "]},
{"date": "2019-10-04 09:38", "link": "https://newyork.craigslist.org/que/egr/d/long-island-city-staff-engineer/6992418839.html", "text": "staff engineer/architect/autocad and design", "compensation": "compensation: above industry average, based on experience", "type": "full-time", "address": ["\n        ", "\n", "\nWe are in the search for a staff engineer, PE or EIT preferred but not required. ", "\nPlease note that RA or staff architect with qualifications will be strongly considered. We like architects and work with many! ", "\nAll levels of experience considered, and will be compensated appropriately. Experienced/proficiency with autocad highly considered.", "\n", "\nWe are a 14 employee mid-sized Professional Corp., located in LONG ISLAND CITY, Queens, we provide owner and contractor support for a wide range of DOB requirements, primarily many contractor required logistics, safety and structural engineering products, as well as full architectural renovations and permanent structural designs. ", "\nWe specialize in the design of temporary structural stability components and sequences, Support of excavation designs, Site Safety Plans, and related contractor equipment designs, as well as architectural and structural renovation projects. ", "\nWe save our clients lots of time and costs by bringing build-able and cost effective designs to approval. It can be done!", "\n", "\nPassion for build-able cost effective, code compliant solutions is required, with the ability to communicate and defend designs in formal calculations and theory for building and temporary component analysis. ", "\nDuties are predominantly autocad production, but will also be asked to attend field inspections, job site meetings and DOB plan exams. Salary range 55k -65k and up, depending on experience. ", "\n", "\nWE ARE ALSO CONSIDERING APPLICANTS WITH MORE EXPERIENCE, AND WILL COMPENSATE ACCORDINGLY. we are also open to entry level, provided autocad experience. We are equal opportunity employer.", "\n", "\nBENEFITS:", "\nAs well as above industry standard salaries, we offer employer contribution in health/dental care, 401k matching saving plan, weekly employer sponsored team building lunch, in-house continuing ed (as part of our DOB/IAS accreditation), and basically an all around good rewarding time producing highly respected products!", "\n", "\nFor consideration:", "\nIN COVER LETTER, PLEASE STATE ANYTHING YOU WOULD LIKE US TO KNOW ABOUT WHY YOU ARE A GOOD CHOICE, PLEASE INCLUDE YOUR SALARY RANGE REQUIREMENTS. ", "\n", "\nPlease include resume in body of email or as pdf, not word doc or google drive.", "\n", "\nThanks, good luck in your job search.    "]},
{"date": "2019-10-04 14:53", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-construction-risk-specialist/6992703736.html", "text": "Construction Risk Specialist", "compensation": "Commensurate with experience", "type": "full-time", "address": ["\n        ", "\nInfrastructure Advisors (www.infrastructure-advisors.com) is a boutique advisory firm focused on the broad and unique multidisciplinary needs of the development of public infrastructure, with a focus on complex capital projects including public private partnerships. Our mission is to assist effective deployment of capital as a tool to develop enhanced equity and economic opportunity around the world. In that regard, we believe professional advisors and their services play a key and crucial role in effective and efficient development process including deployment of capital for optimal benefits.", "\n", "\nWe also believe infrastructure is not an engineering or financial problem - it requires an ecosystem of interactive and supportive parts.  As a result, the role of multidisciplinary strategic decision support to public sector is critical.  Working at the intersection of financial, technical and commercial matters, our services provide the much needed integration that crosses domain and disciplinary boundaries for a holistic solution.  Additionally, by enabling the convergence of management consulting, program/project management, and financial advisory, we foster unprecedented advantages for our clients.", "\n", "\nWe are currently looking for a full time Risk Specialist with 3+ yrs of experience (with or without a graduate degree) to perform design and construction related risk assessment and management.  Preferred experience includes risk identifications, risk assessments, risk analysis and modeling, as well as project monitoring. Experience as a consultant and with Primavera P6, Primavera Risk Analysis, MS Project, and @Risk will be considered valuable.  The opportunity is to work with our client in planning and building the biggest infrastructure projects in the NY /NJ area. Good communications and presentation skills required. Salary commensurate with experience. A Bachelors or Masters in Engineering/Architecture/Construction Management would be preferred.", "\n", "\nPlease send resumes immediately to the designated email address. Candidates will be shortlisted very soon.", "\n", "\n    "]},
{"date": "2019-10-04 17:13", "link": "https://newyork.craigslist.org/fct/egr/d/stamford-earn-up-to-19-hr-deliver-with/6992822818.html", "text": "Earn up to $19/hr! Deliver with Grubhub - Apply now!", "compensation": "Per order fee + mileage + 100% tips", "type": "contract", "address": ["\n        ", "\n\n        ", "\n    "]},
{"date": "2019-10-04 17:24", "link": "https://newyork.craigslist.org/que/egr/d/new-york-construction-site-supervisor/6992831794.html", "text": "Construction Site Supervisor", "compensation": "Will be discussed on personal interview", "type": "full-time", "address": ["\n        ", "\nWe are a General Construction Company and we have an opening for Site Superintendent. Candidates should have a minimum of:", "\n", "\n1. Experience working for a General Construction Company", "\n2. Must have OSHA 30 and DOB Site Superintendent Certification", "\n3. A valid driver's licence", "\n4. Ability to read and understand project blue prints", "\n5. Communicate with on-site sub-contractors, facility personnel and client", "\n6. Proficiency in daily record keeping and communicating with the Project Manager    "]},
{"date": "2019-10-05 22:52", "link": "https://newyork.craigslist.org/que/egr/d/flushing-seeking-autocad-architecture/6993661222.html", "text": "Seeking AutoCad Architecture Draft persons", "compensation": "Compensation based upon experience", "type": "employee's choice", "address": ["\n        ", "\nLicensed Architect Firm in Flushing seeks Architect Office Assistants and Architectural AutoCad draft persons. Architectural background and experience in NYC Zoning and Building Code is a plus. Need strong computer skills. ", "\nThe company is located in flushing, Queens. ", "\n", "\nPlease send resume and salary request for interview.    "]},
{"date": "2019-10-06 09:39", "link": "https://newyork.craigslist.org/brk/egr/d/port-monmouth-construction-site/6993772409.html", "text": "Construction Site Supervisor", "compensation": "Based on Experience & Knowledge", "type": "full-time", "address": ["\n        ", "\nConstruction Site Supervisor:", "\n", "\nCoordinate subcontractors, suppliers and order materials. ", "\nMust be very organized, neat and safety conscious. ", "\n", "\nA self starter who is able to motivate and organize a team of skilled workers. ", "\nMust be able to read and interpret architectural / engineering plans and specifications. ", "\n", "\nAbility to layout and coordinate architectural details with respect to all trades and MEP requirements.    "]},
{"date": "2019-10-06 17:10", "link": "https://newyork.craigslist.org/fct/egr/d/stamford-earn-up-to-19-hr-deliver-with/6994059709.html", "text": "Earn up to $19/hr! Deliver with Grubhub - Apply now!", "compensation": "Per order fee + mileage + 100% tips", "type": "contract", "address": ["\n        ", "\n\n        ", "\n    "]},
{"date": "2019-10-06 17:40", "link": "https://newyork.craigslist.org/que/egr/d/woodside-earn-up-to-18-hr-deliver-with/6994078467.html", "text": "Earn up to $18/hr! Deliver with Grubhub - Apply now!", "compensation": "Per order fee + mileage + 100% tips", "type": "contract", "address": ["\n        ", "\n\n        ", "\n    "]},
{"date": "2019-10-06 17:19", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-earn-up-to-24-hr-deliver-with/6994065493.html", "text": "Earn up to $24/hr! Deliver with Grubhub - Apply now!", "compensation": "Per order fee + mileage + 100% tips", "type": "contract", "address": ["\n        ", "\n\n        ", "\n    "]},
{"date": "2019-10-06 18:51", "link": "https://newyork.craigslist.org/que/egr/d/project-manager/6994119152.html", "text": "Project Manager", "compensation": "Based on experience", "type": "full-time", "address": ["\n        ", "\nProject manager needed for drywall company based in queens.", "\nMust have experience as a project manager on drywall jobs", "\nMust be reliable, motivated and excellent organizational skills.", "\nProficient in  take off, reading plans, prepare proposals, quick books, Microsoft word and excel.", "\nMust have the ability to manage new and existing drywall construction.", "\nPlease send salary requirements with resume.", "\nThe ideal candidate must be well versed in the drywall industry", "\n    "]}
]